[{"user_id": "1562705", "question_page_id": "1436598", "url": "http://www.medhelp.org/posts/Dermatology/itching-legs-turns-into-bruises/show/1436598", "question_title": "itching legs turns into bruises", "question_content": "My legs itch all day. It is more of a sharp sting than an itch really. When I scratch them even if only slightly it turns into dark bruises which take so long so go away. any suggstions", "question_post_id": "post_6545012", "comment_num": "1", "user_name": "geminigirl118", "question_time": "Jan 14, 2011", "question_forum_name": "Dermatology Community"},
{"user_id": "1562710", "question_page_id": "1436601", "url": "http://www.medhelp.org/posts/Ear--Nose--Throat/Cant-breathe-through-my-nose-and-is-constantly-blocked/show/1436601", "question_title": "Can't breathe through my nose and is constantly blocked", "question_content": "I am a 19 year old femas and have had trouble breathing through my nose as long as i can remember.I get shortness of breath often, when doing things such as kissing my partner and have to pull away coz i lose my breath. I always have a \"cold\" basically a runny nose and snore really heavily. I also breathe very heavily and is quite embaressing for me as it is so noticable. If anyone has any solutions for this then i would really appreciate it as it's starting to get me down.Thanks, Kayler", "question_post_id": "post_6545040", "comment_num": "3", "user_name": "kaylerpreece", "question_time": "Jan 14, 2011", "question_forum_name": "Ear, Nose & Throat Community"},
{"user_id": "1398966", "question_page_id": "1436600", "url": "http://www.medhelp.org/posts/Epilepsy/Tegretol-kills-kidneys/show/1436600", "question_title": "Tegretol kills kidneys!?", "question_content": "Two years and my kidneys do not function. I read reports of Tegretol as bad and old medicine that needs out of the market. I now need a transplant.Can tegretol take away my kidney function in 2 years time? I say yes because I have no family history of kidney failure. I kept a good diet. Epilepsy developed all of the sudden back in 2000.", "question_post_id": "post_6545022", "comment_num": "1", "user_name": "stefano28", "question_time": "Jan 14, 2011", "question_forum_name": "Epilepsy Community"},
{"user_id": "1305368", "question_page_id": "1436595", "url": "http://www.medhelp.org/posts/Cats/Benny-the-Bengal/show/1436595", "question_title": "Benny the Bengal", "question_content": "Benny is one of the cats at the shelter.He came about a month ago when his owner surrendered him to the shelter.At first he would hiss and growl anytime anybody even just walked past his kennel.Every time I was at the shelter I would stop outside his kennel and talk to him for a couple of minutes, ignoring his hisses and growls, or rather treating them like they were just his responses to our little conversations.After a few days, I would open his kennel gate to have the conversations, a few more days and I started to put my hand in the kennel.By now he had stopped hissing but still cowered in the back of his kennel.He finally started coming up to my hand and rubbing his head and chin against it.Finally, earlier this week, I left his kennel door open and just sat down a few feet away.He came out of his kennel and rubbed up against my legs.He let me pick him up and put him in my lap.After a few minutes, he jumped down and started to explore.He walked by a few of the kennels with other cats in them and just looked, no hissing or growling, just looking.Since then, he has been fine with who ever does the daily cleaning and feeding in that group of kennels, letting them pick him up out of the kennel and letting him roam around the room while his digs are being cleaned.Benny is typical of cats who are owner surrendered.In a way, they can be harder to adopt out thanstrays.Strays tend to be pretty content at the shelter because they are warm and safe and eating regularly, so it is usually a step up from their previous digs.For owner surrenders though, it is typically pretty depressing to go from having the run of a house to being cooped up with hundreds of other cats.It takes a lot of work and patience to help them adjust so that they have an opportunity to be adopted.", "question_post_id": "post_6545003", "comment_num": "2", "user_name": "nancyjac", "question_time": "Jan 14, 2011", "question_forum_name": "Cats Community"},
{"user_id": "1562699", "question_page_id": "1436596", "url": "http://www.medhelp.org/posts/Weight-Loss--Healthy-Lifestyle/Copper-T-disadvantages/show/1436596", "question_title": "Copper T disadvantages", "question_content": "Hi i am wearing copper t since the last 2 years i am not having any major problem but am very much worried that i am gaining weight, can u please tell me does copper t lead to weight gain and can excercise be done ? Skipping or treadmill", "question_post_id": "post_6545005", "comment_num": "0", "user_name": "neha1984", "question_time": "Jan 14, 2011", "question_forum_name": "Weight Loss & Healthy Lifestyle Expert Forum"},
{"user_id": "1562700", "question_page_id": "1436594", "url": "http://www.medhelp.org/posts/Womens-Health/DESPERATE-LILLIE/show/1436594", "question_title": "DESPERATE LILLIE", "question_content": "I HAVE BLOOD CLOTS ON MY LUNGS ,I'VE HAD A TIA A COUPLE OF YEARS AGO,I HAVE BEEN EXPERIENCING PAIN IN MY CHEST,NUMBNESS IN MY FINGERS AND PAIN IN MY HANDS,I'M A SMOKER,I'M OVER WEIGHT I HAVE ASTHMA,ANXIETY,PANIC ATTACKS,FIBRIOD TUMORS,AND I'M A BI POLAR SCHIZOPHRANIC THAT TAKES GEODON AND CUMADIN ,VISTERAL,TOPAMAX", "question_post_id": "post_6544996", "comment_num": "1", "user_name": "lillie227", "question_time": "Jan 14, 2011", "question_forum_name": "Women's Health Community"},
{"user_id": "736293", "question_page_id": "1436602", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/Anyone-else-been-on-Procardia/show/1436602", "question_title": "Anyone else been on Procardia?", "question_content": "I am currently 29 weeks pregnant and went into preterm labor earlier this week.I am now on bedrest and taking Procardia every six hours to stop contractions.This morning I noticed after I took it that my feet and legs felt very warm and itchy and when I looked at them the were bright red.I looked up the side effects online and it says that it can cause swelling of the feet and ankles, but if mine were swollen it wasn't hardly noticable.I was just wondering if anyone else has taken Procardia and expirienced anything similar.I'm not sure if it's worth bothering my Dr. over or if I should just wait and see how my next dose goes.", "question_post_id": "post_6545041", "comment_num": "5", "user_name": "kylesMom09", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562716", "question_page_id": "1436603", "url": "http://www.medhelp.org/posts/Undiagnosed-Symptoms/menapause/show/1436603", "question_title": "menapause", "question_content": "im 30 years old and i had uterus and right ovary removed over year ago i suffer from depression and anxiety but my moods are worse i still have pain rite side nite sweats chills 2why help", "question_post_id": "post_6545046", "comment_num": "4", "user_name": "beth0411", "question_time": "Jan 14, 2011", "question_forum_name": "Undiagnosed Symptoms Community"},
{"user_id": "1562713", "question_page_id": "1436604", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/is-this-threatened-miscarriage/show/1436604", "question_title": "is this threatened miscarriage", "question_content": "I had my last period on Nov 22010, I should be about 11 weeks pregnant but my ultrasound today showed only 7 weeks. I have moderate bleeding and craming , the doc prescribed Duphaston and asked me to come back in a week. I am 41 in very good health and have 3 children.", "question_post_id": "post_6545047", "comment_num": "2", "user_name": "lubnayagoub", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562703", "question_page_id": "1436597", "url": "http://www.medhelp.org/posts/Mens-Health/Diagnosed-with-HSV1-and-2/show/1436597", "question_title": "Diagnosed with HSV1 and 2", "question_content": "I recently started talking to this girl, a good girl, and out of couriosity, before we hooked up I took a full panel std blood test.Everything came back good except for HSV1 and 2.My heart about fell through the floor.I had to tell the girl, and after I did she was very supportive.I had scheduled a doctors appointment for the following week, and her and I had protected intercourse the saturday before.After speaking with the doctor, he ordered some more blood work and observed my penis.I have never had any kind of lesions or anything that would have signalled to me that I had herpes.After observing my penis, he didn't see anything and advised that the blood tests are hard to go by because they dont show an antigen but they show an antibody.I was feeling a little relieved, because I had never had any kind of symptoms, and I told the girl this.We have continued having sex, and we have even had a couple of unprotected encounters including oral.Atthe beginning of this week, she was complaining of swollen glands and feeling sick.Last night, she told me she felt a UTI was coming.The results for my secondary test came in and they were the same, positive.I go to the doctor's office for a follow up on Monday, and I feel utterly devastated that I may have passed this on to her.How can I approach her about this?I have been completely up front and honest about my status with her, and I am having so much anxiety about telling her that she may have contracted it. Please help!", "question_post_id": "post_6545008", "comment_num": "1", "user_name": "bigdealjl", "question_time": "Jan 14, 2011", "question_forum_name": "Men's Health Community"},
{"user_id": "1562718", "question_page_id": "1436606", "url": "http://www.medhelp.org/posts/Mens-Health/C7-fracture/show/1436606", "question_title": "C7 fracture", "question_content": "I fractured my C7 vertabrae several months ago and still can hearing a grinding noise when I turn my head side to side. Is this normal?", "question_post_id": "post_6545051", "comment_num": "1", "user_name": "scullett", "question_time": "Jan 14, 2011", "question_forum_name": "Men's Health Community"},
{"user_id": "1562638", "question_page_id": "1436610", "url": "http://www.medhelp.org/posts/HIV-Prevention/urgent-help/show/1436610", "question_title": "urgent help", "question_content": "y CDC s are claiming that oral sex carry a little risk? but here you r claiming ORAL SEX is not risky?", "question_post_id": "post_6545083", "comment_num": "4", "user_name": "amitsarkar", "question_time": "Jan 14, 2011", "question_forum_name": "HIV Prevention Community"},
{"user_id": "1261477", "question_page_id": "1436613", "url": "http://www.medhelp.org/posts/Thyroid-Cancer---Nodules--Hyperthyroidism/Could-there-be-a-connection-between-cortisol-dysregulation-and-chest-pain/show/1436613", "question_title": "Could there be a connection between cortisol dysregulation and chest pa...", "question_content": "I am a female age 54, being tested by neurologist for Myasthenia Gravis with possible associated disease. Positive EMG, positive clinical assessment, sero-negative. Insomniac for 15 months when symptoms emerged. Prior to that had a nontoxic cold nodule. When I awake, in the morning and every time I awake during the night, I awake to medically confirmed non-cardiac, non-musculoskeletal chest pain. Pain seems to be consistently related to sleep/wake mechanism only. Lasts maybe 5 minutes after waking, feels like a tightening or spasm. I've read that cortisol weakens the activity of the immune system. Could the hypothalamus be giving orders to the adrenals to produce a super-surge of cortisol in response to Myasthenia Gravis or other associated disease, in an effort to control the overactive immune system? I couldn't find a forum to address this so I hope someone will refer me to the proper forum. Thanks.", "question_post_id": "post_6545102", "comment_num": "2", "user_name": "Shiela747", "question_time": "Jan 14, 2011", "question_forum_name": "Thyroid Cancer / Nodules & Hyperthyroidism Expert Forum"},
{"user_id": "1562727", "question_page_id": "1436618", "url": "http://www.medhelp.org/posts/Erectile-Dysfunction/symptoms-of-having-anxiety-attack/show/1436618", "question_title": "symptoms of having anxiety attack", "question_content": "how to know when ur having anxiety attackThis discussion is related to .", "question_post_id": "post_6545115", "comment_num": "1", "user_name": "kamarazaheer", "question_time": "Jan 14, 2011", "question_forum_name": "Erectile Dysfunction Community"},
{"user_id": "1562715", "question_page_id": "1436611", "url": "http://www.medhelp.org/posts/Gastroenterology/Gastro-Nightmare/show/1436611", "question_title": "Gastro Nightmare", "question_content": "My wife had surgery Nov 1 for a small bowel obstruction due to scar tissue.The surgeon to me that her bowel and adhesions were \"a mangeled mess.\"She ended up spending 19 days in the hospital, and came home very sick.She cannot eat without torture.Even one bite leaves her very sick and in pain for an hour or more.The symptoms begin in about 10-15 minutes after swallowing.She has been through a multitude of tests by the surgeon.The radiologist has suggested that she may have problems with her mesantery artery.The gastric emptying test showed gastroparesis.However, nothing I read indicates that her pain and nausea should come on so suddenly.She is rapidly loosing weight and we are desperate.", "question_post_id": "post_6545086", "comment_num": "1", "user_name": "gamma1961", "question_time": "Jan 14, 2011", "question_forum_name": "Gastroenterology Community"},
{"user_id": "1562714", "question_page_id": "1436607", "url": "http://www.medhelp.org/posts/Birth-Control-Contraception-/Diaphragm/show/1436607", "question_title": "Diaphragm", "question_content": "Hi Everyone,I'm 18 years old and have been using a diaphragm for the past six months.If I keep using a diaphragm for the next few years, while I continue to grow, will I have to start using a different size?How will I know when I the size is no longer right for me?I got fitted about 6 months ago, and it seems to be fine, I'm just wondering about what I should do in the future and if the diaphragm is actually the best choice for me.Would love to hear other diaphragm users' experience.Cheers!", "question_post_id": "post_6545054", "comment_num": "0", "user_name": "katiebaker13", "question_time": "Jan 14, 2011", "question_forum_name": "Birth Control (Contraception)  Community"},
{"user_id": "1562720", "question_page_id": "1436608", "url": "http://www.medhelp.org/posts/Dogs/dogs-exposed-nerve-at-dew-claw/show/1436608", "question_title": "dogs exposed nerve at dew claw", "question_content": "My pitboxer mix came inside last night and somehow pulled his nail covering up and completely exposing the nerve of the dew claw.What can I do to help him?It's not bleeding but it is completley exposed.", "question_post_id": "post_6545068", "comment_num": "3", "user_name": "kellygallman", "question_time": "Jan 14, 2011", "question_forum_name": "Dogs Community"},
{"user_id": "1562724", "question_page_id": "1436616", "url": "http://www.medhelp.org/posts/Heart-Disease/Mild-Aortic-Ectasia/show/1436616", "question_title": "Mild Aortic Ectasia", "question_content": "My brother passed away at 33 with an aortic dissection of the descending thoracic artery approx dia of 4.5My father 57 years old has an aortic aneurysm of the descending thoracic artery with a dia of 4.8My grandfather passed away at 77 with a dissection descending thoracic artery approx dia of 5.1I just received my results and I have a mild aortic ectasia of 4.0 of the descending thoracic artery, how concerned should I be?", "question_post_id": "post_6545108", "comment_num": "0", "user_name": "ralph685", "question_time": "Jan 14, 2011", "question_forum_name": "Heart Disease Community"},
{"user_id": "398059", "question_page_id": "1436614", "url": "http://www.medhelp.org/posts/Multiple-Sclerosis/I-know/show/1436614", "question_title": "I know", "question_content": "I know I said I was taking a break; and I am.But, this is shocking and am not sure how to handle this.:)Well, I am no longer considered a Gemini; I am now a Taurus.That silly moon has changed everything.New Zodiac Signs:Capricorn: January 20- February 16Aquarius: February 17 - March 11Pisces: March 12 - April 18Aries: April 19 - May 13Taurus: May 14 - June 21Gemini: June 22 - July 20Cancer: July 21 - August 10Leo: August 11 - September 16Virgo: September 17 - October 30Libra: October 31 - November 23Scorpio: November 24 - 29Ophiuchus: November 30 - December 17Sagittarius: December 18 - January 20", "question_post_id": "post_6545104", "comment_num": "7", "user_name": "MCBCON", "question_time": "Jan 14, 2011", "question_forum_name": "Multiple Sclerosis Community"},
{"user_id": "1562702", "question_page_id": "1436599", "url": "http://www.medhelp.org/posts/STDs/STDs-NEED-HELP/show/1436599", "question_title": "STD's NEED HELP", "question_content": "Please Help,I went to a brothelsometime ago, there I had sex with a random girl, unfortunately the condom broke. Kissing was also involved.2 days after that in the afternoon I felt symtoms  of a sore throat, the next day I had a throat ache and I also realized I had white spots on one of my tonsills (right, it was swollen to), they seem like puss or something. I had a very odd night the same day aswell, sometimes it felt really cold and sometimes it was very hot.The throat doest hurt or anything normally it only hurts when I eat. I have no coughing, I can just feel a lot of mucus accumulating in the tonsills region.PLEASE HELP ME OUT, its the 5th day today, the tonsill still has white spots on it, but I dont have a fever anymore, it hurts while eating, I sometimes feel a bit tired.THANKS!", "question_post_id": "post_6545020", "comment_num": "5", "user_name": "has123", "question_time": "Jan 14, 2011", "question_forum_name": "STDs Community"},
{"user_id": "1562725", "question_page_id": "1436615", "url": "http://www.medhelp.org/posts/Radiology-/Possible-Breast-Cancer-Metastasis/show/1436615", "question_title": "Possible Breast Cancer Metastasis?", "question_content": "My wife was diagnosed stage 4 breast cancer(7cm tumor, HER2+, strongly ER/PR+) 12/08 due to right hilar lymphodenapathy. Did well with treatment and was in complete remission, but had local recurrence 6/10 so she had a double mastectomy 9/10. Recent CT/PET in December showed the following area of concern: On the CT ,states\"New 2mm nodule in the left upper lob which is non specific. Continued follow-up surveillance is recommended\". On the PET, states\" there is a new, approximately 2mm pulmonary nodule in the left upper lobe...There is activity noted in the region of the left anterior chest wall, likely related to brown fat, however this focus of activity is inseparable from this new, subpleural pulmonary nodule and has an SUV max of 1.7\". I appreciate your answer to these questions:1)Our oncologist plans to rescan in 2months, since he knows my wife is a \"nervous person\". Most places I read recommend waiting 3 months at least...is 2 months too soon?2) Based on the way this radiologist explained this and my wife's history, what do you think the chances are this is cancerous?3)It doesn't indicate an SUV for the 2mm nodule, but it does for the area \"inseparable area likely related to brown fat\", which is 1.7. What do you think the significance of this is?Thanks in advance for your answer. Also would like to add that she is a non smoker and on her scan before surgery on 9/10, the CT report said the lungs were clear.I appreciate honesty and I understand my wife's oncologist not wanting to get her possibly upset, but I would really appreciate an unbiased opinion of this report. I have read online the size of 2mm means it's a good chance not malignant, but then also read if it's new or history of other cancer, the odds go up.Thanks again", "question_post_id": "post_6545106", "comment_num": "0", "user_name": "stumper96", "question_time": "Jan 14, 2011", "question_forum_name": "Radiology  Community"},
{"user_id": "1562713", "question_page_id": "1436612", "url": "http://www.medhelp.org/posts/Pregnancy-35/Is-this-a-threatened-miscarriage/show/1436612", "question_title": "Is this a threatened miscarriage?", "question_content": "I am 41 and in good health. Today I should be about 11 weeks pregnant but my ultrasound showed only 7 weeks. I have mild bleeding and craming for the last week or so,my doctor precribed Duphaston ( Dydrogesterone) is it going to help? is there any hope in this pregnancy. I have 3 children never had any complications before.", "question_post_id": "post_6545097", "comment_num": "10", "user_name": "lubnayagoub", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 35+ Community"},
{"user_id": "1562726", "question_page_id": "1436620", "url": "http://www.medhelp.org/posts/HIV-Prevention/Oral-Sex/show/1436620", "question_title": "Oral Sex", "question_content": "Hi,I wanted to get your opinions on something.I met a girl from the internet and she performed oral sex on me for about 30 minutes.I am an uncircumsized male.Exactly 3 weeks after this I came down with a sore throat.That started about 2 days before exactly three weeks and at the exact 3 week mark I came down with a fever. The fever lasted for a day then seemed to go away then came back again for one day.During the 3 days with the fever the sore throat persisted and I also had some body aches.On the last day the fever was present I had some night sweats.That was two nights ago and I have had the night sweats on both nights since but the fever and sore throat are gone.Does this sound like ARS to anyone?Thanks,", "question_post_id": "post_6545127", "comment_num": "8", "user_name": "CambridgeWorried", "question_time": "Jan 14, 2011", "question_forum_name": "HIV Prevention Community"},
{"user_id": "1507909", "question_page_id": "1436605", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/sick/show/1436605", "question_title": "sick", "question_content": "how long r u supposed to have morning sickness because i will be 19 weeks tomorrow and i still get sick in the morning and sometimes in the middle of the day and im tired of it ugh i hate that feeling other than that i feel fine", "question_post_id": "post_6545050", "comment_num": "9", "user_name": "oshee1122", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562734", "question_page_id": "1436626", "url": "http://www.medhelp.org/posts/Dental-Health/Is-this-an-emergency/show/1436626", "question_title": "Is this an emergency?", "question_content": "I'm scheduled to go and have a filling replaced in a few days but yesterday a small piece of that same tooth broke off, revealing the decay and the filling underneath.It's just the corner of the tooth.Most of the tooth remains in my mouth.There was no pain and there has been no pain since it happened, about 20 hours ago.Does this change things?Should I ask to have it seen right away (since it could fall apart in the meantime) or is that unreasonable, since they might decide that it's possible to replace the filling as planned?", "question_post_id": "post_6545158", "comment_num": "1", "user_name": "Theperson45", "question_time": "Jan 14, 2011", "question_forum_name": "Dental Health Community"},
{"user_id": "1557157", "question_page_id": "1436619", "url": "http://www.medhelp.org/posts/Pregnancy-Sep-2011-Babies/When-can-you-see-something-in-sac/show/1436619", "question_title": "When can you see something in sac?", "question_content": "Hi ladies. I am currently 5 weeks pregnant, due September 2nd. Yesterday I was in the hospital because I had some bleeding and passed a blood clot. They did an ultrasound and there was a sac but nothing in it. They said that is normal. Does anyone know when you should start seeing something inside the sac? Should I be worried?", "question_post_id": "post_6545126", "comment_num": "8", "user_name": "unexpectedblessing2011", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy: Sep 2011 Babies Community"},
{"user_id": "1562711", "question_page_id": "1436609", "url": "http://www.medhelp.org/posts/STDs/Can-I-get-an-STD-from-a-handjob-if-the-woman-put-saliva-on-her-palm/show/1436609", "question_title": "Can I get an STD from a handjob if the woman put saliva on her palm?", "question_content": "Hello Doctor,I am 24.About a week ago, I picked up a woman in my car.She gave me a handjob and put just enough saliva on her palm for some lubrication--not swimming, but just enough.I came in her hand, dropped her off, and washed my testicles and penis with soap and water in a Walgreens bathroom about 5 minutes later.I don't know if she was crazy, homeless, a prostitute (she asked for money but I said no and she did it anyway)---but she looked crazy and dirty and her hand might have had dirt or sand on it.In the bathroom, I noticed rough red marks near and just under the head of my penis, but I think it was from chafing of the handjob (like rugburn) and they have since disappeared.I was very nervous and urinated in that bathroom and it hurt a little when I peed.This pain has dissipated since that morning of the incident.My penis has not changed in any noticeable way since before the handjob.I have no new marks or pains.Is it possible that I have contracted an STD?Thank you for your time and help!", "question_post_id": "post_6545072", "comment_num": "6", "user_name": "stood", "question_time": "Jan 14, 2011", "question_forum_name": "STDs Community"},
{"user_id": "1559475", "question_page_id": "1436625", "url": "http://www.medhelp.org/posts/Gastroenterology/Strong-bowel-movement/show/1436625", "question_title": "Strong bowel movement?", "question_content": "Hello since I was young at the age of 12 I started to suffer from problems regarding the bowel and with horrible gas pain, my bowels were \"talking\" strong and it was very embrhassing... lately I'm feeling something I never had before I think it calls prelastic of the bowels? (sorry for my english) I'm feeling that my bowels moves very strong I did only a colonscopy check what checks I have to do more? I think my stomach don't process well the food I'll thank any help", "question_post_id": "post_6545153", "comment_num": "2", "user_name": "sarit770", "question_time": "Jan 14, 2011", "question_forum_name": "Gastroenterology Community"},
{"user_id": "505857", "question_page_id": "1436617", "url": "http://www.medhelp.org/posts/Weight-Loss--Dieting/Whats-wrong-with-me/show/1436617", "question_title": "Whats wrong with me!!!!", "question_content": "i weigh 15stone 4lbs and i've been told if i don't lose 3stone i won't be given IVF from my hospital and i have 2 years to do it.So i've cut my calories down to 1500 per day but i am absolutely starving.I constantly keep having stomach cramps like it needs to grumble but it won't do it.I've just eaten a healthy turkey salad for lunch and feel i could eat more, its a really uncomfortable feeling in my stomach.Could this be my stomach shrinking while getting used to not eating so much?Could it also be that my period is due in less than a week so my cravings for food have increased?I really want to show i can lose the weight but scared i'll fall back.I have exercised on my Kinect twice this week, and i'm starting my zumba next week.All information is much appreciated", "question_post_id": "post_6545114", "comment_num": "10", "user_name": "gillianl", "question_time": "Jan 14, 2011", "question_forum_name": "Weight Loss & Dieting Community"},
{"user_id": "1562729", "question_page_id": "1436621", "url": "http://www.medhelp.org/posts/Eye-Care/New-eyeglasses-problem/show/1436621", "question_title": "New eyeglasses problem", "question_content": "Hi, I have just made a new eye glasses,And i realized that when i look at objects that are near, the things appear to be smaller. I wore back my old glasses and realized that the object is bigger at the exact same distance.What is happening? must i change my new eyeglasses? my eye degree approx 850 degrees. Please help me.", "question_post_id": "post_6545128", "comment_num": "3", "user_name": "Jarsofclay", "question_time": "Jan 14, 2011", "question_forum_name": "Eye Care Community"},
{"user_id": "1561842", "question_page_id": "1436622", "url": "http://www.medhelp.org/posts/Multiple-Sclerosis/Fresh-Meat/show/1436622", "question_title": "Fresh Meat", "question_content": "As suggested in Lulu54's introduction thread, just here to introduce myself. Freshly diagnosed with MS a scant 48 hours ago. I did a bit of lurking on here for the 6 weeks I was determined to have Clinically Isolated Syndrome, but as I'm now \"official\" I'm outing myself. For more details on the surprise turn of events since November (never a hint of more than mono or chicken pox in my life), I have written a journal entry on my profile page. I'm not sure how active I'll be as my current issue is visual (and happily I'm getting a lot of direct advice from consultants and MS nurse specialists), but as I'm in the \"choose your disease modifying treatment\" stage of the game, I may have a few direct questions in that area. I'm being treated at a research hospital, meaning I have a rather dizzying array of options. Baffling at the moment, but exciting too (science geek).I'm not sure how many people are on here from outside the U.S. (pretty sure I saw a couple of mentions of the NHS), but I can offer a little European solidarity (Ireland, here) if called upon.", "question_post_id": "post_6545146", "comment_num": "15", "user_name": "Bette_Noire", "question_time": "Jan 14, 2011", "question_forum_name": "Multiple Sclerosis Community"},
{"user_id": "1493485", "question_page_id": "1436628", "url": "http://www.medhelp.org/posts/Teen-Health/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436628", "question_title": "FREE Health Chat - Thyroid Disorders: When Your Thyroid Malfunctions", "question_content": "FREE Health Chat - Thyroid Disorders: When Your Thyroid MalfunctionsMonday Jan 17, 2011, 08:00PM - 09:00PM (EST)Come join Dr. Lupo for a free,hour-long chat discussing thyroid cancer, Grave's Disease, Hashimoto's, hypothyroidism, hyperthyroidism, and other thyroid diseases, symptoms, medications and treatments, including thyroid surgery, Radioactive Iodine treatment (RAI), fine needle aspiration (FNA) and thyroid stimulating hormones (TSH).Register now and submit your question (we'll send you a reminder e-mail):Looking forward to seeing you at the chat.", "question_post_id": "post_6545165", "comment_num": "0", "user_name": "Steve_MHCommunity", "question_time": "Jan 14, 2011", "question_forum_name": "Teen Health Community"},
{"user_id": "1558497", "question_page_id": "1436631", "url": "http://www.medhelp.org/posts/Ask-a-Nurse/Type-of-doctor-to-see/show/1436631", "question_title": "Type of doctor to see?", "question_content": "Hello, I have pain in my stomach possibly pancreas and in my scrotum testicle area. 27 year old male. The symptoms are possibly unrelated. Can someone please give me a suggestion on what type of doctor I should see first? I have no insurance. Would it be better to see a specialist or a family physician first and why type if specialist? Thank you for your time.", "question_post_id": "post_6545184", "comment_num": "2", "user_name": "Dfilcos", "question_time": "Jan 14, 2011", "question_forum_name": "Ask a Nurse Expert Forum"},
{"user_id": "37749", "question_page_id": "1436627", "url": "http://www.medhelp.org/posts/Hepatitis-B/drugs-with-relevant-hbsag-decrease-hbv-eradication/show/1436627", "question_title": "drugs with relevant hbsag decrease/hbv eradication", "question_content": "to make a sum of all drugs that have real potential to eradicate hbv (hbsag negative) or relevant decrease of hbsag monotherapy: peginterferon (11%) nitazoxanide (25% but trials were too small and only for 1 year so it maybe much more or less especially combo with other durgs) combiantion: interferon+nitazoxanide interferon+telbivudine (dangerous sides effects possible, close monitoring necessary but 1log decrease in 24 weeks is reported, the most potent effect reported in such small period) entecavir+nitazoxanide (lowers hbsag too early to say how much eradication percentage is but of course more than ntz monotherapy) tenofovir+nitazoxanide (no data yet but probable since case reports of ntz+adv) interferon+entecavir (probable but not data yet, only case reports) interferon+tenofovir (probable but not data yet, only case reports) all other therapies have almost no relevant effect except tenofovir on hbeag positive 16% in 3-4 years, maybe more in the following years but on hbeag neg eradication of hbsag is still 0% all other monotherapies no relevant effect on hbsag", "question_post_id": "post_6545161", "comment_num": "1", "user_name": "stef2011", "question_time": "Jan 14, 2011", "question_forum_name": "Hepatitis B Community"},
{"user_id": "1561663", "question_page_id": "1436629", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/due-date-determination/show/1436629", "question_title": "due date determination", "question_content": "I found out I was pregnant late last summer, and went into my OB's office for an ultrasound.The ultrasound determined I was 6 weeks 6 days along in my pregnancy and gave me the due date March 25th.We did this ultrasound to determine the due date because I wasn't sure if I knew the first day of my last period ( I conceived while I was weening my 10 mos. old daughter and so my body was definitely going through a transition).Giving it a little more thought though I realized I do know the first day of my last period to be May 12th (my only period btwn the two pregnancies).Should I consider my due date based on my period or based on the early ultrasound?", "question_post_id": "post_6545167", "comment_num": "4", "user_name": "nmbaker", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562737", "question_page_id": "1436636", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/trying-to-conceive/show/1436636", "question_title": "trying to conceive", "question_content": "could i be pregnant if i discharge pink and brown 4 3 weeks", "question_post_id": "post_6545208", "comment_num": "2", "user_name": "niecybok", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562606", "question_page_id": "1436623", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/Please-comment-on-this-if-you-have-got-pregnant-on-the-depro/show/1436623", "question_title": "Please comment on this if you have got pregnant on the depro", "question_content": "Im just so worried and need to know how common this is, effects on the mother and baby and symptoms :(", "question_post_id": "post_6545149", "comment_num": "0", "user_name": "rcm29", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562737", "question_page_id": "1436624", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/Am-i-pregnant/show/1436624", "question_title": "Am i pregnant", "question_content": "i have had brown and pinkish discharge everyday for 3 weeks on and off wat could it be", "question_post_id": "post_6545150", "comment_num": "3", "user_name": "niecybok", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562746", "question_page_id": "1436638", "url": "http://www.medhelp.org/posts/Pain-Management/Methadone--Cancer/show/1436638", "question_title": "Methadone & Cancer....", "question_content": "Hi, I am on 110mg's of methadone.I am just about to start treatment for rectal cancer. I am doing radition and chemo and I understand that it can be VERY painful so what my question is what type of painkiller works when you are taking methadone? I am not sure what works and what doesn't so if anyone has any info or has experienced this I really would appriciate any feedback you may have. Thank you in advance for your help :-)Jeannie", "question_post_id": "post_6545218", "comment_num": "1", "user_name": "jeannie6", "question_time": "Jan 14, 2011", "question_forum_name": "Pain Management Community"},
{"user_id": "1558076", "question_page_id": "1436639", "url": "http://www.medhelp.org/posts/HIV---Prevention/HIV-and-STD-risk/show/1436639", "question_title": "HIV and STD risk", "question_content": "Hi Doc!I am a Chinese and now I am in U.S. I had unprotected intercourse that lasted 15 minutes with a prostitute in China 5 days ago. This was my first time having unprotected sex with a sex worker. There were 2 - 3 small inflammations that were caused by balanitis on my penis head during the sex. The prostitute said she has been a sex worker for a few months. The prostitute also told me that she was clean but didn't test for HIV yet and she checked my penis carefully before sex. I have several questions.1.If the prostitute is HIV positive, will the balanitis inflammation increase the risk of contracting HIV from her? My Chinese doctor who is not a HIV specialist said the virus will get into my body through the cells on inflammation area. What is the overall risk of this exposure?2.When should I go for a HIV test and other STD test after this exposure? What kind of HIV test would you recommend? I am very worried about my situation so I don't think I will wait for 3 months to take a test.3.What are other STD risk involves in this exposure and after how longI can make sure that I don't have these if there are no symptoms.Thank you very much!Best regards,Superryh", "question_post_id": "post_6545219", "comment_num": "3", "user_name": "superryh", "question_time": "Jan 14, 2011", "question_forum_name": "HIV - Prevention Expert Forum"},
{"user_id": "1562741", "question_page_id": "1436633", "url": "http://www.medhelp.org/posts/Migraines--Headaches/Migraine-HA-Topiramate-use/show/1436633", "question_title": "Migraine HA Topiramate use", "question_content": "Hi.My son is 15 yo and has recently been prescribed Topiramate 50mg Daily preventive use for Classic Migraine HA and \"added bonus to decrease mood swings.\" Amongst many other concerns I have, I am concerned with remarks of weight loss. He is already very thin with a very good appetite.How much weight loss can I expect and does anyone have experience with the mood swings issue? Thanks,Pammmy6 :)", "question_post_id": "post_6545199", "comment_num": "4", "user_name": "Pammmy6", "question_time": "Jan 14, 2011", "question_forum_name": "Migraines & Headaches Community"},
{"user_id": "1493485", "question_page_id": "1436630", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436630", "question_title": "FREE Health Chat - Thyroid Disorders: When Your Thyroid Malfunctions", "question_content": "FREE Health Chat - Thyroid Disorders: When Your Thyroid MalfunctionsMonday Jan 17, 2011, 08:00PM - 09:00PM (EST)Come join Dr. Lupo for a free,hour-long chat discussing thyroid cancer, Grave's Disease, Hashimoto's, hypothyroidism, hyperthyroidism, and other thyroid diseases, symptoms, medications and treatments, including thyroid surgery, Radioactive Iodine treatment (RAI), fine needle aspiration (FNA) and thyroid stimulating hormones (TSH).Register now and submit your question (we'll send you a reminder e-mail):Looking forward to seeing you at the chat.", "question_post_id": "post_6545178", "comment_num": "0", "user_name": "Steve_MHCommunity", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 18-24   Community"},
{"user_id": "1562743", "question_page_id": "1436637", "url": "http://www.medhelp.org/posts/Heart-Rhythm/Concerned-about-Holter-and-Echo-Results/show/1436637", "question_title": "Concerned about Holter and Echo Results", "question_content": "I had an echo and a 24 hr holter due to palpitations. The holter results state:398 Total Ventricular Ectopics, 351 isolated beats, 16 couplets, 4 runs, 79 Supraventricular ectopicsNo tachycardia, no bradycardiaThe echo showed mild aortic insuf.,redundant mitral valve,eccentric mild mitral regurg.,My primary didnt seem concerned and put me on a beta blocker (atenolol). I am very concerned and decided to make an appt with a cardiologist but it will take 3 weeks to see him. Are my worries valid based upon these results?", "question_post_id": "post_6545210", "comment_num": "1", "user_name": "DF0403", "question_time": "Jan 14, 2011", "question_forum_name": "Heart Rhythm Community"},
{"user_id": "1493485", "question_page_id": "1436635", "url": "http://www.medhelp.org/posts/Pregnancy-35/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436635", "question_title": "FREE Health Chat - Thyroid Disorders: When Your Thyroid Malfunctions", "question_content": "FREE Health Chat - Thyroid Disorders: When Your Thyroid MalfunctionsMonday Jan 17, 2011, 08:00PM - 09:00PM (EST)Come join Dr. Lupo for a free,hour-long chat discussing thyroid cancer, Grave's Disease, Hashimoto's, hypothyroidism, hyperthyroidism, and other thyroid diseases, symptoms, medications and treatments, including thyroid surgery, Radioactive Iodine treatment (RAI), fine needle aspiration (FNA) and thyroid stimulating hormones (TSH).Register now and submit your question (we'll send you a reminder e-mail):Looking forward to seeing you at the chat.", "question_post_id": "post_6545205", "comment_num": "0", "user_name": "Steve_MHCommunity", "question_time": "Jan 14, 2011", "question_forum_name": "Pregnancy 35+ Community"},
{"user_id": "1493485", "question_page_id": "1436640", "url": "http://www.medhelp.org/posts/Lyme-Disease/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436640", "question_title": "FREE Health Chat - Thyroid Disorders: When Your Thyroid Malfunctions", "question_content": "FREE Health Chat - Thyroid Disorders: When Your Thyroid MalfunctionsMonday Jan 17, 2011, 08:00PM - 09:00PM (EST)Come join Dr. Lupo for a free,hour-long chat discussing thyroid cancer, Grave's Disease, Hashimoto's, hypothyroidism, hyperthyroidism, and other thyroid diseases, symptoms, medications and treatments, including thyroid surgery, Radioactive Iodine treatment (RAI), fine needle aspiration (FNA) and thyroid stimulating hormones (TSH).Register now and submit your question (we'll send you a reminder e-mail):Looking forward to seeing you at the chat.", "question_post_id": "post_6545223", "comment_num": "0", "user_name": "Steve_MHCommunity", "question_time": "Jan 14, 2011", "question_forum_name": "Lyme Disease Community"},
{"user_id": "1562732", "question_page_id": "1436634", "url": "http://www.medhelp.org/posts/Gastroenterology/Elevated-ALT-and-AST--High-abdominal-pain-and-rib-cage-aches/show/1436634", "question_title": "Elevated ALT and AST, High abdominal pain and rib cage aches", "question_content": "Day 1 While at dinner I noticed it felt like someone kicked me in my upper stomach and I waited it out and was ok. I thought it was just a tummy ache.Day 3 I ate a piece of pretty plain but fatty roasted chicken, and an hour later I collapsed with a pain that felt like someone kicked me in the upper stomach, almost where the rib cage meets in the center. It was difficult to breathe and got worse over ten minutes until I was overcome with sweating, nausea, dizziness and disorientation. I was brought to the emergency room and the symptoms faded away over about 2 hours. All my labs were normal, EKG normal, urine normal and was sent home with a prescription for Zantac (they think it was just acid reflux). Day 4 So I ate that night and was fine with my Zantac, and the next morning after I ate the same episode happened within 30 minutes but much worse. I vomited and had a bowel movement that was normal, the pain was worse and lasted longer (2-3 hours) but continued to sit there in the background (2 on a pain scale). I was able to eat brown rice, eggs, bread and peas and carrots without issues later on.I went to my doctor on DAY 5 My ASTlevel was 45 and my ALT was 60. They did an utlrasound of my liver, gallbladder, spleen and kidneys and they looked clean, so gallstones or other gallbladder issues were out. However, when the doctor first examined me onshe pressed up on my liver and seemed to know that it would be sore, and then she stopped because she was convinced the issue was there. She ordered more blood tests and said to make another appt in a week. What?? Clearly there is something wrong here. I continued to have level 2 pain along my ribs sometimes radiating into my back and difficulty breathing at times. I ate chicken noodle soup and white bread, and yogurt.Day 6 I feel more localized pain in my bottom, front, left rib. Almost near the edge and more to the center of the torso. It feels like something is poking me there. It is dull and feels like it almost throbs. Again I have no appetite or desire to drink but I have eaten crackers. It aches where my underwire would be and even out to the back of my ribcage. 3-4 on a pain scale maybe but tolerable. And this is where I am posting, as my doctors havent even considered upper GI issues. I had an Upper GI done several years ago and there was a cloudy spot near my duodenum. I was supposed to swallow a camera but I moved and forgot. however, they hadn't made a big deal out of it so I didn't bother.I had a stomach flu (they did several blood and stool tests and could not find out what it was) that lasted 15 days. It started with intense lower abdominal cramps for 6 days and the last days my body pushed everything out that I attempted to eat. i couldn't eat the first ten days until they gave me antinausea meds. I have been losing weight since this \"flu\" about 2 months ago.I have recently increased the amount of beans in my diet as I believe I have pre-diabetes and PCOS along with diagnosed cyclical migraines and an imbalance in my inner ears. I am diagnosed with chronic cysts that burst and I had a cyst burst on my ovary the last week of december causing extreme pain, this happens every two months or so.I have a history of a malignant polyp found on my colon ten years ago followed up with clean colonoscopies every year. There are diabetes, bone cancer, thyroid cancer, and diverticulitis in my family.The symptoms I have felt the last three days:-difficulty breathing-ache in rib cage underneath breasts to the outside as well (where an underwire sits) that radiates as achy pain in the same spot on my back-followed by a constant localized achy pain in my left ribcage near the center, bottom of the ribs.-eye puffiness-a migraine that lasted nearly two weeks-light burping throughout my day even when i haven't eaten or drank anything-loss of appetite for several weeks, no desire to drink water though I usually drink 8 bottles a day-mental blocks, I have a hard time finding words lately-episodic pain following meals in upper stomach, lower rib cage 10 on a pain scale-increased levels of AST (45) and ALT (60)I think that's it! Clearly I have a lot of other issues, but I do know when something is wrong in my body. Ideas??", "question_post_id": "post_6545201", "comment_num": "1", "user_name": "delmont02122", "question_time": "Jan 14, 2011", "question_forum_name": "Gastroenterology Community"},
{"user_id": "1562740", "question_page_id": "1436632", "url": "http://www.medhelp.org/posts/Ovarian-Cysts/gynecological-follow-up-after-rectal-cancer/show/1436632", "question_title": "gynecological follow up after rectal cancer", "question_content": "Wondering what kind of follow up is recommended s/p rectal cancer treatment.No ovarian cancer in my family and the colon cancer was of the non-heredity type.There was significant anastomotic leak/repeat pre-sacral abscess/multiple drain attempts and now with 5th try of enteral stents trying to keep peri-rectal area open for drainage.Have 2nd diverting ileostomy now. LAR was performed in 2005.Unfortunately have had persistent low sacral pain/perineal pain thought secondary to the prolonged inflammation/interventions/fibrosis and maybe radiation related, too.Transvaginal u/s now shows cyst on left ovary. My last period was in 2005. Have had close to 100 CT scans to check on the abscess/collection and each says pelvic organs unremarkable.Gynecologist wants to rpt. u/s in 3 mos.Thank you very much,K", "question_post_id": "post_6545198", "comment_num": "2", "user_name": "kathy830", "question_time": "Jan 14, 2011", "question_forum_name": "Ovarian Cysts Community"},
{"user_id": "1562748", "question_page_id": "1436641", "url": "http://www.medhelp.org/posts/Womens-Health/who-could-be-the-daddy/show/1436641", "question_title": "who could be the daddy?", "question_content": "ok i had my lmp around dec 9th, 2010. i had sex with my ex on dec 13th, we broke up and i started seein someone else i had sex with him dec. 20th through jan 7th. i took a home pregancy test on jan 4th and it was positive am im scared i mite mess up the good releationship i have goin on now if i am pregant by the first guy can someone please tell me what they think and who it could be?", "question_post_id": "post_6545226", "comment_num": "2", "user_name": "brandi_r2010", "question_time": "Jan 14, 2011", "question_forum_name": "Women's Health Community"}]