[{"question_page_id": "1436600", "url": "http://www.medhelp.org/posts/Epilepsy/Tegretol-kills-kidneys/show/1436600", "comment_num": "1", "question_post_id": "post_6545022", "comment_time": ["post_6549279_true|Jan 15, 2011", "post_6549279|Jan 15, 2011"], "comment_user_id": ["post_6549279_true|1156914", "post_6549279|1156914"], "comment_post_id": ["post_6549279_true", "post_6549279"], "comment_content": ["post_6549279_true|", "post_6549279|Hi thereAny kind of chronic medication can cause kidney failure. They should have been checking your function every once in a while though and they should have been able to pick it up earlier. It's absolutely ridiculous that it's gotten to this stage.I hope that you are able to get the transplant. All the best"]},
{"question_page_id": "1436602", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/Anyone-else-been-on-Procardia/show/1436602", "comment_num": "5", "question_post_id": "post_6545041", "comment_time": ["post_6545287|Jan 14, 2011", "post_6545350|Jan 14, 2011", "post_6545383|Jan 14, 2011", "post_6545388|Jan 14, 2011", "post_6545421|Jan 14, 2011"], "comment_user_id": ["post_6545287|1155599", "post_6545350|1561668", "post_6545383|184674", "post_6545388|349463", "post_6545421|736293"], "comment_post_id": ["post_6545287", "post_6545350", "post_6545383", "post_6545388", "post_6545421"], "comment_content": ["post_6545287|I'm taking it now for blood pressure, but haven't had anything like that. Sorry, I'm no help!!! Good Luck!! :)", "post_6545350|I took it during my last to pregnancies and never had that happen. I would call your dr it is possible it is something else, but no matter what it is you need to let your dr know. Hope all goes well.", "post_6545383|I took Procardia for preterm labor and never had that happen. I'd call your doctor just as a precaution.", "post_6545388|I had a little swelling and they took me off it and switched me to tributaline (?). I think when in doubt call the dr. Good luck.", "post_6545421|Thanks ladies...It went away after about an hour, but I'll probably call just to be on the saf side.Nicmom - I was given terbutaline in the hospital to stop the contractions, but it didn't work and it made my heartrate jump too high so I couldn't be on it anymore.I guess we'll just see what else they will try :)"]},
{"question_page_id": "1436601", "url": "http://www.medhelp.org/posts/Ear--Nose--Throat/Cant-breathe-through-my-nose-and-is-constantly-blocked/show/1436601", "comment_num": "3", "question_post_id": "post_6545040", "comment_time": ["post_6546100|Jan 14, 2011", "post_6568038|Jan 21, 2011", "post_8550826|Nov 25, 2012"], "comment_user_id": ["post_6546100|974371", "post_6568038|1562710", "post_8550826|4391580"], "comment_post_id": ["post_6546100", "post_6568038", "post_8550826"], "comment_content": ["post_6546100|I don't know about the heavy breathing but I'd see an ENT doc if I were you.My daughter had the same problems and she had a deviated septum. She had surgery in August and has much improved since then.She can now breath through her nose and sleeps much better at night.", "post_6568038|Thanks very much, i have an appointment at the doctors for Monday so will hopefully get reffered.", "post_8550826|What kind of surgery did she have? Did the surgery hurt? Did your daughter feel as if she could not breath well through one side of her nose? Does she still have little problems or did completely vanished?I would truly appreciate if you answered my questions....I have been having problems with my breathing over 19 years of life."]},
{"question_page_id": "1436603", "url": "http://www.medhelp.org/posts/Undiagnosed-Symptoms/menapause/show/1436603", "comment_num": "4", "question_post_id": "post_6545046", "comment_time": ["post_6546952_true|Jan 14, 2011", "post_6545214|Jan 14, 2011", "post_6546077|Jan 14, 2011", "post_6546952|Jan 14, 2011", "post_6548072|Jan 15, 2011"], "comment_user_id": ["post_6546952_true|351246", "post_6545214|1268057", "post_6546077|1556126", "post_6546952|351246", "post_6548072|1562716"], "comment_post_id": ["post_6546952_true", "post_6545214", "post_6546077", "post_6546952", "post_6548072"], "comment_content": ["post_6546952_true|", "post_6545214|Are you taking any hormone replacements?", "post_6546077|Wow, I would definitely make an appointment to see your Dr and find out why you are getting chills. As for your Depression and Anxiety, you need to find a good Psych so he/she can find the right kind of med for you. I thought that my Depression could never get better. But, with talk therapy and Medication I am currently stable. What we have is not easy and will take alot of med tries to find the one that works for you. But, at the end you need mental peace and relief, because depression can make you ill and moody. I thank my husband for sticking with ALL my mood swings. So, don't give up!", "post_6546952|Hi Welcome to the MedHelp forum!Since one ovary and uterus was removed, chances of hormonal imbalance are always there. Thyroid problems and abnormal levels of FSH, LH, prolactin, androgen hormones or male hormones and estrogen hormones can be the cause and hence get this tested. If there is pain on right side, then possibility of gut disorders like colitis, IBS, kidney stones etc should be looked into. The pain can also be due to adhesions formed post surgery.I think you should discuss these possibilities with your doctor. It is difficult to comment beyond this without examining. A comprehensive investigation is required keeping all the points in mind. Take care!", "post_6548072|wow thanks i reallly appreciate the advice and suggestions"]},
{"question_page_id": "1436596", "url": "http://www.medhelp.org/posts/Weight-Loss--Healthy-Lifestyle/Copper-T-disadvantages/show/1436596", "comment_num": "0", "question_post_id": "post_6545005", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436597", "url": "http://www.medhelp.org/posts/Mens-Health/Diagnosed-with-HSV1-and-2/show/1436597", "comment_num": "1", "question_post_id": "post_6545008", "comment_time": ["post_6548993|Jan 15, 2011"], "comment_user_id": ["post_6548993|1239269"], "comment_post_id": ["post_6548993"], "comment_content": ["post_6548993|Hi, As your name suggests, this is not a big deal, why worry then, what would have happened if you did not get it tested? Understandably, there are drugs to suppress the outbreak and one can live with it without much problem. So relax and do not worry, you can not go back in time any way.Solace."]},
{"question_page_id": "1436598", "url": "http://www.medhelp.org/posts/Dermatology/itching-legs-turns-into-bruises/show/1436598", "comment_num": "1", "question_post_id": "post_6545012", "comment_time": ["post_6564009|Jan 20, 2011"], "comment_user_id": ["post_6564009|563773"], "comment_post_id": ["post_6564009"], "comment_content": ["post_6564009|Hello,It can be due to stasis dermatitis, vascular eczema or lichen simplex chronicus. If there is bruising after scratching then that also needs evaluation. You can decrease water and soap contact, and apply emollients. Topical steroids are almost always needed to control the symptoms. You can use mild steroid cream like Dermacort and if the symptoms persist then high potency steroids and oral steroids may be needed. Also take some antihistaminic to control itching.My sincere advice would be to consult a dermatologist to get the diagnosis confirmed. It is very difficult to precisely confirm a diagnosis without examination and investigations and the answer is based on the medical information provided. For exact diagnosis, you are requested to consult your dermatologist. I sincerely hope that helps. Take care and please do keep me posted on how you are doing."]},
{"question_page_id": "1436604", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/is-this-threatened-miscarriage/show/1436604", "comment_num": "2", "question_post_id": "post_6545047", "comment_time": ["post_6545098|Jan 14, 2011", "post_6545133|Jan 14, 2011"], "comment_user_id": ["post_6545098|1456473", "post_6545133|1271927"], "comment_post_id": ["post_6545098", "post_6545133"], "comment_content": ["post_6545098|it sounds like threatened miscarriage unless your dates and ovulation are off. reast over the next week and good luck", "post_6545133|I would tend to disagree. If you last period was November 2, then at 4 weeks of pregnancy that would be around December 2. Then 8 weeks of pregnancy would be around January 2. To get closer to today, add about another week of pregnancy, so you are around 9ish weeks of pregnancy - not quite 11 weeks. My early ultrasound said that I was about a week and a half off of when I knew I ovulated (test strips). Some of us ovulate later, and some of us even implant later (that's me!). So at this point I wouldn't give up hope at all. I think you calculated your dates a bit off, if you are a later ovulater, a late implanter and maybe baby is a slow grower then all these things can add up to a week or so difference. And maybe the ultrasound showed 7 weeks and a few days - there is some more time! I would take it easy and do as the dr says, but don't give up hope yet. I wouldn't determine threatened miscarriage until some hcg numbers start showing weird stuff!"]},
{"question_page_id": "1436599", "url": "http://www.medhelp.org/posts/STDs/STDs-NEED-HELP/show/1436599", "comment_num": "5", "question_post_id": "post_6545020", "comment_time": ["post_6545055|Jan 14, 2011", "post_6545079|Jan 14, 2011", "post_6545194|Jan 14, 2011", "post_6545209|Jan 14, 2011", "post_6545357|Jan 14, 2011"], "comment_user_id": ["post_6545055|580755", "post_6545079|1562702", "post_6545194|580755", "post_6545209|1562702", "post_6545357|580755"], "comment_post_id": ["post_6545055", "post_6545079", "post_6545194", "post_6545209", "post_6545357"], "comment_content": ["post_6545055|Your throat has nothing to do with an STD from kissing and has nothing to do with anything you could get from a condom break.", "post_6545079|Then buddy what do you reckon I have?I have never had a swallen throat with white spots before, so naturally all my blame goes to the unprotected sex I had? =/", "post_6545194|See a Dr, this is a STD specific forum and this is not a STD related issue.I would suggest on testing for STD's based on the condom break.", "post_6545209|May I ask you one more thing, when should I get tested for STD's? I have heard their is a specific time to get tested, as in tests cant detect the disease before a specific time has elapsed?Btw, thanks for your help..", "post_6545357|No problem.Gonorrhea and Chlamydia-1 weekSyphilis-6 weeksHIV-3 monthsHerpes 3-4 months"]},
{"question_page_id": "1436608", "url": "http://www.medhelp.org/posts/Dogs/dogs-exposed-nerve-at-dew-claw/show/1436608", "comment_num": "3", "question_post_id": "post_6545068", "comment_time": ["post_6545457|Jan 14, 2011", "post_6546084|Jan 14, 2011", "post_6546088|Jan 14, 2011"], "comment_user_id": ["post_6545457|82861", "post_6546084|1562902", "post_6546088|974371"], "comment_post_id": ["post_6545457", "post_6546084", "post_6546088"], "comment_content": ["post_6545457|You'll need to have a vet take a look at it.This is why dew claws need to be removed from some dogs since they tend to get caught on things as they run around.Sometimes they rip the entire joint off.The concern right now is that it will get infected since the nerve is exposed, in addition to being a painful injury.", "post_6546084|i would certainly call the vet!i would think at least it would need to be treated with a topical antibiotic and kept clean.", "post_6546088|Is the dog in pain?If so, or it looks infected, your Vet should check it.If it's not bleeding, infected, etc, you may try washing it with luke warm water, put some antibiotic ointment on it and clean gauze with some Vet wrap (you can get at PetsMart).Keep an eye on it daily.Not that uncommon an injury and I agree with Jay, wish breeder would remove the things.Removing them at birth, if they are small, is very easy.Removing them when a dog is older is surgery and painful."]},
{"question_page_id": "1436607", "url": "http://www.medhelp.org/posts/Birth-Control-Contraception-/Diaphragm/show/1436607", "comment_num": "0", "question_post_id": "post_6545054", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436613", "url": "http://www.medhelp.org/posts/Thyroid-Cancer---Nodules--Hyperthyroidism/Could-there-be-a-connection-between-cortisol-dysregulation-and-chest-pain/show/1436613", "comment_num": "2", "question_post_id": "post_6545102", "comment_time": ["post_6579308|Jan 24, 2011", "post_6605070|Feb 01, 2011"], "comment_user_id": ["post_6579308|97953", "post_6605070|1261477"], "comment_post_id": ["post_6579308", "post_6605070"], "comment_content": ["post_6579308|Would discuss with your neurologist.If there is an adrenal question, then blood tests for cortisol can be done to ensure adequate adrenal function.", "post_6605070|Is there a cortisol test that will measure spikes during the night/day?"]},
{"question_page_id": "1436606", "url": "http://www.medhelp.org/posts/Mens-Health/C7-fracture/show/1436606", "comment_num": "1", "question_post_id": "post_6545051", "comment_time": ["post_6550013|Jan 15, 2011"], "comment_user_id": ["post_6550013|513029"], "comment_post_id": ["post_6550013"], "comment_content": ["post_6550013|Did you have surgery for this? If you can give us some more information that would be really helpful."]},
{"question_page_id": "1436618", "url": "http://www.medhelp.org/posts/Erectile-Dysfunction/symptoms-of-having-anxiety-attack/show/1436618", "comment_num": "1", "question_post_id": "post_6545115", "comment_time": ["post_6546229|Jan 14, 2011"], "comment_user_id": ["post_6546229|1556079"], "comment_post_id": ["post_6546229"], "comment_content": ["post_6546229|Are you asking, or just letting people know?"]},
{"question_page_id": "1436611", "url": "http://www.medhelp.org/posts/Gastroenterology/Gastro-Nightmare/show/1436611", "comment_num": "1", "question_post_id": "post_6545086", "comment_time": ["post_6546244|Jan 14, 2011"], "comment_user_id": ["post_6546244|793560"], "comment_post_id": ["post_6546244"], "comment_content": ["post_6546244|Welcome to the gastroenterology community!In gastroparesis, pain and nausea can come on as soon as 10-15 minutes after eating.It sounds like gastroparesis to me.What medications has she tried for this?"]},
{"question_page_id": "1436610", "url": "http://www.medhelp.org/posts/HIV-Prevention/urgent-help/show/1436610", "comment_num": "4", "question_post_id": "post_6545083", "comment_time": ["post_6545099|Jan 14, 2011", "post_6545311|Jan 14, 2011", "post_6545389|Jan 14, 2011", "post_9784781|Dec 25, 2013"], "comment_user_id": ["post_6545099|173692", "post_6545311|1562638", "post_6545389|580755", "post_9784781|173692"], "comment_post_id": ["post_6545099", "post_6545311", "post_6545389", "post_9784781"], "comment_content": ["post_6545099|No incident HIV infections among MSM who practice exclusively oral sex.Int Conf AIDS 2004 Jul 11-16; 15:(abstract no. WePpC2072)??Balls JE, Evans JL, Dilley J, Osmond D, Shiboski S, Shiboski C, Klausner J, McFarland W, Greenspan D, Page-Shafer K?University of California, San Francisco, San Francisco, United States Oral transmission of HIV, reality or fiction? An update J Campo1, MA Perea1, J del Romero2, J Cano1, V Hernando2, A Bascones1 Oral Diseases (2006) 12, 219-228 AIDS: Volume 16(17) 22 November 2002 pp 2350-2352 Risk of HIV infection attributable to oral sex among men who have sex with men and in the population of men who have sex with men Page-Shafer, Kimberlya,b; Shiboski, Caroline Hb; Osmond, Dennis Hc; Dilley, Jamesd; McFarland, Willie; Shiboski, Steve Cc; Klausner, Jeffrey De; Balls, Joycea; Greenspan, Deborahb; Greenspan Page-Shafer K, Veugelers PJ, Moss AR, Strathdee S, Kaldor JM, van Griensven GJ. Sexual risk behavior and risk factors for HIV-1 seroconversion in homosexual men participating in the Tricontinental Seroconverter Study, 1982-1994 [published erratum appears in Am J Epidemiol 1997 15 Dec; 146(12):1076]. Am J Epidemiol 1997, 146:531-542. Studies which show the fallacy of relying on anecdotal evidence as opposed to carefully controlled study insofar as HIV transmission risk is concerned: Jenicek M. \"Clinical Case Reporting\" in Evidence-Based Medicine. Oxford: Butterworth-Heinemann; 1999:117 Saltzman SP, Stoddard AM, McCusker J, Moon MW, Mayer KH. Reliability of self-reported sexual behavior risk factors for HIV infection in homosexual men. Public Health Rep. 1987 102(6):692-697.Nov-Dec; Catania JA, Gibson DR, Chitwood DD, Coates TJ. Methodological problems in AIDS behavioral research: influences on measurement error and participation bias in studies of sexual behavior. Psychol Bull. 1990 Nov;108(3):339-362. There is no debate (among experts) about the HIV risks associated with oral sex. The risk is so low that almost nobody who cares for HIV infected patients has ever had a patient believed to have been infected that way. Among experts, it's a semantic issue about using terms like \"no risk\" and \"very low risk\". There is no difference between my or Dr. Hook's use of \"low risk\" and other experts' \"no risk\". DR. HANSFIELD \"And oral sex is basically safe sex -- completely safe with respect to HIV and although not zero risk for other STDs, the chance of infection is far lower than for unprotected vaginal or anal sex. Please educate yourself about the real risks. If you stick with oral sex and condom-protected vaginal or anal sex, you have no HIV worries and very little worry about other STDs. \" DR HANSFIELD \"I am sure you can find lots of people who belive that HIV is transmitted by oral sex, but you will not find scientific data to support this unrealistic concern...\" DR HOOK \"HIV is not spread by touching, masturbation, oral sex or condom protected sex.\"- DR. HOOK in the public HIV Prevention forum of MedHelp, TEAK and the other moderators maintain that oral sex in all forms is a zero risk activity. Would you agree with this assessment? I TOTALLY AGREE / DR GARCIA \"The observation on thousands and thousands of observations is that HIV is not spread by oral sex (of any sort).\" DR HOOK", "post_6545311|thanks a lot...but i m rely getting afraid of HIV...in many sites and forum(THE BODY) claims tht people rreportdly gettinginfected from oral sex....I got 5 mins blowjob froma sex worker.nt sure abouth blood in her mouth.so can u plz teme me that how much blood will be required for HIV transmission", "post_6545389|How much blood? More then you have seen in your lifetime.No risk.", "post_9784781|Seek professional mental help."]},
{"question_page_id": "1436612", "url": "http://www.medhelp.org/posts/Pregnancy-35/Is-this-a-threatened-miscarriage/show/1436612", "comment_num": "10", "question_post_id": "post_6545097", "comment_time": ["post_6545384|Jan 14, 2011", "post_6545499|Jan 14, 2011", "post_6545509|Jan 14, 2011", "post_6548595|Jan 15, 2011", "post_6548598|Jan 15, 2011", "post_6548599|Jan 15, 2011", "post_6552646|Jan 16, 2011", "post_6556162|Jan 17, 2011", "post_6565185|Jan 20, 2011", "post_6565858|Jan 20, 2011"], "comment_user_id": ["post_6545384|121828", "post_6545499|1105753", "post_6545509|1386249", "post_6548595|1556219", "post_6548598|1556219", "post_6548599|1556219", "post_6552646|142087", "post_6556162|1150573", "post_6565185|1562713", "post_6565858|1386249"], "comment_post_id": ["post_6545384", "post_6545499", "post_6545509", "post_6548595", "post_6548598", "post_6548599", "post_6552646", "post_6556162", "post_6565185", "post_6565858"], "comment_content": ["post_6545384|Wow, 4 weeks off is a lot. Are you sure you're dates are correct?Did you see a heartbeat and was it strong?", "post_6545499|I'm so sorry you are going thru this. The exact same situation happened with me at 10.5 weeks but the baby not only showed 7 weeks but had no HB. If you saw a HB there is hope. The doctors must have thought there was some hope or they wouldn't have prescribed anything to help with the pregnancy and would'be told you that you would miscarry. Good luck to you, I hope everything turns out ok.", "post_6545509|The same thing happened to me at 11 weeks.I was never given any meds to help and never heard of anyone given any meds to help.I had cramping and spotting.When I was at 11 weeks, my ultrasounds showed 7 weeks, then 6 weeks, then 5 weeks, until my miscarriage and D&C.It is still possible for you to get through this and have a health baby.Ive heard many stories of women getting over the cramping and bleeding with a health baby, but with these symptoms, odds are against you.Im sorry, and I hope you get through this with a health little one!", "post_6548595|I too, am 41 and but I have suffered 2 mc's. I know the fear you are facing and it really *****.If they gave you something then you should assume you are okay.I too, have heard of similar situations that turned out absolutely fine.Our fingers are crossed for you. My heart is with you.", "post_6548598|Wow, I got censored for saying *****, hmmm...", "post_6548599|suxcks.", "post_6552646|Thinking of you.", "post_6556162|Hi, I just wanted to let you know that if the Dr's are giving you meds I too agree that is a good sign.. The odds are not stacked against you yet... Stay POSITIVE, CALM, and pray ..What ever will be will be.... Wishing God's blessing on you , and your baby for a full term pregnanacy... I am 42 soon to be 43 still ttc.. I have had 4 MC , but I'm not going to give up...... Keep us posted and SSBD......Mary...:)", "post_6565185|Thank u all for your support and warm feelings. I am sorry I lost the baby the next day from my doc visit. I am fine and coming over it.", "post_6565858|Im sorry to hear about your loss, but I am glad to hear that you are fine.Its not easy, and many of us have gone through it.I miscarried at 11 weeks, but we are TTC again.KIT!We are here for you!You are in my thoughts and prayers."]},
{"question_page_id": "1436616", "url": "http://www.medhelp.org/posts/Heart-Disease/Mild-Aortic-Ectasia/show/1436616", "comment_num": "0", "question_post_id": "post_6545108", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436614", "url": "http://www.medhelp.org/posts/Multiple-Sclerosis/I-know/show/1436614", "comment_num": "7", "question_post_id": "post_6545104", "comment_time": ["post_6545138|Jan 14, 2011", "post_6545288|Jan 14, 2011", "post_6545360|Jan 14, 2011", "post_6545878|Jan 14, 2011", "post_6545909|Jan 14, 2011", "post_6548067|Jan 15, 2011", "post_6548154|Jan 15, 2011"], "comment_user_id": ["post_6545138|667078", "post_6545288|479766", "post_6545360|516780", "post_6545878|1312898", "post_6545909|559187", "post_6548067|1253197", "post_6548154|704043"], "comment_post_id": ["post_6545138", "post_6545288", "post_6545360", "post_6545878", "post_6545909", "post_6548067", "post_6548154"], "comment_content": ["post_6545138|My husband is a Taurus and the stars seem to align with him. So there you have it may be your fortune will change?Alex", "post_6545288|What! I'm Capricorn now! Who is this interloper Ophiucus, when did this happen? I shan't sleep tonight :)Mand", "post_6545360|I am not a Virgo and my husband is a Gemini.Why did this change?Maybe I should look it up online...what the heck!", "post_6545878|very strange.I am still a Leo but just barely", "post_6545909|This has been big news today.Threw my whole astrological identity. :)", "post_6548067|Oh no I feel I have lost a little bit of who I am. I have always been an Aries and my birthday is April 18 and apparently I am now a Pisces and I know nothing about them!. I do not understand how the dates have changed as i am not very scientific or aware of astrology. I just love looking at the stars on a clear night and know a few of the constellations but that is as far as my knowledge extends.", "post_6548154|Now this isnt right!!! Ihave been a libra -lolforever!! now whats up--- you cant teach a old dog new tricks..humm a virgo??might be better than libra have to see -thanks mcbcon- ithink-"]},
{"question_page_id": "1436595", "url": "http://www.medhelp.org/posts/Cats/Benny-the-Bengal/show/1436595", "comment_num": "2", "question_post_id": "post_6545003", "comment_time": ["post_6545426|Jan 14, 2011", "post_6547617|Jan 14, 2011"], "comment_user_id": ["post_6545426|587315", "post_6547617|1305368"], "comment_post_id": ["post_6545426", "post_6547617"], "comment_content": ["post_6545426|Glad to hear that Benny's coming around nicely with your TLC!!And, you are so right, the surrendered animals are much more terrified, then the strays that have never had a home to begin with.It's very heartbreaking.Poor Benny.Have any idea what Benny's story is?I hope the special guy gets a wonderful home with a loyal owner.He surely deserves it!!", "post_6547617|Unfortunately, Benny is now sick.He has a very stuffed up nose and was gagging up some flem  which has made him really cranky again.We are going to to have to force oral meds down him for the next several days, so once he is well again, I may have have to start all over again building trust."]},
{"question_page_id": "1436620", "url": "http://www.medhelp.org/posts/HIV-Prevention/Oral-Sex/show/1436620", "comment_num": "8", "question_post_id": "post_6545127", "comment_time": ["post_6545139|Jan 14, 2011", "post_6545152|Jan 14, 2011", "post_6545164|Jan 14, 2011", "post_6545392|Jan 14, 2011", "post_6545432|Jan 14, 2011", "post_6545571|Jan 14, 2011", "post_6545895|Jan 14, 2011", "post_6545932|Jan 14, 2011"], "comment_user_id": ["post_6545139|173692", "post_6545152|1562726", "post_6545164|186166", "post_6545392|1562726", "post_6545432|580755", "post_6545571|1562726", "post_6545895|1562726", "post_6545932|580755"], "comment_post_id": ["post_6545139", "post_6545152", "post_6545164", "post_6545392", "post_6545432", "post_6545571", "post_6545895", "post_6545932"], "comment_content": ["post_6545139|You never had an exposure so no it is not ARS.", "post_6545152|I guess I was more curious if this was ARS would all the symptoms not occur all at once?I have never in my life had night sweats before?Is this likely because I'm so stressed over this situation?", "post_6545164|saliva is not infectious...", "post_6545392|So no comment on if all ARS symptoms appear and leave at once?I'd assume just having night sweats is not a symptom of HIV.", "post_6545432|We ar enot in the business of discussing ARS or symptoms for the most part and when you never had a risk discussing irrevelant issues is well irrelevant.", "post_6545571|Thanks everyone. This has helped to put my mind at ease a bit.I wanted to not worry about this yet here I am worrying about it.I guess I will just hope and pray it is not HIV and get tested as soon as I can and have a reliable result.", "post_6545895|So there is absolutely no need in me testing then?I can carry on without fear of infecting anyone else?", "post_6545932|If you didn't have a risk then why would you need to test?"]},
{"question_page_id": "1436594", "url": "http://www.medhelp.org/posts/Womens-Health/DESPERATE-LILLIE/show/1436594", "comment_num": "1", "question_post_id": "post_6544996", "comment_time": ["post_6545851|Jan 14, 2011"], "comment_user_id": ["post_6545851|82861"], "comment_post_id": ["post_6545851"], "comment_content": ["post_6545851|What is your question exactly, and more important - what does your doctor say?I took topamax for three months for pain management.It did nothing for my pain but it made my hands numb.As the doctor had me increase the dose each month, the numbness expanded to include my entire face and even my tongue.That was enough of that.It took a few weeks for it to finally go away.Maybe it's the topamax causing your numbness?Those symptoms are listed as possible side effects so ask your doctor about it."]},
{"question_page_id": "1436605", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/sick/show/1436605", "comment_num": "9", "question_post_id": "post_6545050", "comment_time": ["post_6545065|Jan 14, 2011", "post_6545123|Jan 14, 2011", "post_6545422|Jan 14, 2011", "post_6545459|Jan 14, 2011", "post_6545615|Jan 14, 2011", "post_6545630|Jan 14, 2011", "post_6545877|Jan 14, 2011", "post_6545964|Jan 14, 2011", "post_6548288|Jan 15, 2011"], "comment_user_id": ["post_6545065|1427484", "post_6545123|1509567", "post_6545422|1440696", "post_6545459|1294482", "post_6545615|676143", "post_6545630|1124862", "post_6545877|280369", "post_6545964|889551", "post_6548288|1507909"], "comment_post_id": ["post_6545065", "post_6545123", "post_6545422", "post_6545459", "post_6545615", "post_6545630", "post_6545877", "post_6545964", "post_6548288"], "comment_content": ["post_6545065|Hi There-I am just 11 weeks with twins and it is starting to get a touch better, but I still gag in the morning and feel lousy at night. I have been on Zofran since week 6 and it has saved my life! Without the Zofran I would not be able to function. If you can deal with the sickness then go with it, but if you can't ask about Zofran. It is safe and VERY effective. I'm not going to tell you to eat saltines and drink gingerale because let's face it- that doesn't really work!!!Hang in there!!", "post_6545123|It's all on you. Everyone experiences it differently. With my first pregnancy, I was sick the ENTIRE time, and even a week after his birth. With this pregnancy (currently 15 weeks), I was going through the same thing, only the sickness had gotten much worse (fainting, throwing up before and after every meal, etc), so I started taking medications for it. Like what CarlaLP said, if you can handle it, go for it, if not, don't hesitate to ask a doctor for a little something, there is no shame in it. Good luck!", "post_6545422|My best friend was sick throughout her entire pregnancy. The doc gave her meds for it, but she would still get sick (just not as often). One tip she gave me was to suck on peppermints. She said that helped calm her stomach sometimes. But I have to admit, it did nothing for my nausea.", "post_6545459|With my son I was sick til i passed the 5 month mark and it didn't go completely away til 6 months. I hope this one is better but I still throw up every morning and get sick throughout the day and am just barely 17 wks. I know it can be really frustrating but they say everyone and every pregnancy is different. Hope you feel better soon. I do take zofran in the mornings to keep my breakfast down and it helps some.", "post_6545615|Each pregnancy is different.As others have said, it could last the entire pregnancy, or finally let up at some point.Personally, I wasn't as sick w/my son...and got over the sickness part by week 16 (still had heartburn the entire time).With this pregnancy, currently 18 1/2 weeks pregnant with a girl, I finally got over being nauseated, which started before I even took the pregnancy test, at around week 13-14.I also vomited a lot more with this one.I hope you get better soon!I also have heard that chewing gum helps, too.I tried it and it seemed to help a little, or maybe it was all in my mind.I also sucked on lollipops in between meals, and it helped a little, too.If nothing else, get the medication, because I know that has helped many people!Best of luck to you!", "post_6545630|i wish i could tell you it will stop at a certain time during pregnancy, but... i am now 35 weeks along and set up for induction in 3 weeks and i still get nausea and have been on zofran since week 12 (i was decided to not take any meds before then but having lost 15 lbs kind of made me give in to them)... i would def talk to your doctor about it.. it really is a life saver... hope you feel better soon!!", "post_6545877|With my first 2 I was nauseous and throwing up until 20-22 weeks. It's a miserable feeling. I had a little break and then around 30-32 weeks I got horrible acid reflux and could barely eat or sleep at night. This time around I am 15 weeks and I am still throwing up several times a day and nauseous 24/7. I am hoping it goes away soon, but it doesn't seem like it will. The only relief I truly get is once I give birth! :P Hang in there! It won't last forever. I wish I had some tips to help calm the nausea, but nothing really works for me.", "post_6545964|I had severe hyperemesis throughout my pregnancy. I even continued to have episodes until a week ago and we are now 5w pp.", "post_6548288|thanks everyone for your input i have a doctors appt. on monday so ill talk to her about it. with my daughter my sickeness was gone by the 12th week and im pregnant now with another lil girl and im 19 weeks and still get sick every morning ugh i hate it but i thank you for all your input at least i know im not the only one.:)"]},
{"question_page_id": "1436619", "url": "http://www.medhelp.org/posts/Pregnancy-Sep-2011-Babies/When-can-you-see-something-in-sac/show/1436619", "comment_num": "8", "question_post_id": "post_6545126", "comment_time": ["post_6545259|Jan 14, 2011", "post_6545338|Jan 14, 2011", "post_6545780|Jan 14, 2011", "post_6548204|Jan 15, 2011", "post_6548480|Jan 15, 2011", "post_6548520|Jan 15, 2011", "post_6548553|Jan 15, 2011", "post_6549352|Jan 15, 2011"], "comment_user_id": ["post_6545259|1556219", "post_6545338|121828", "post_6545780|1399033", "post_6548204|1557157", "post_6548480|1556219", "post_6548520|1557157", "post_6548553|1556219", "post_6549352|1323110"], "comment_post_id": ["post_6545259", "post_6545338", "post_6545780", "post_6548204", "post_6548480", "post_6548520", "post_6548553", "post_6549352"], "comment_content": ["post_6545259|From what I understand you can see something in the sac around 5-6 weeks.Every pregnancy is different, but I too only seen the sac at my u/s I was just 1 day short of five weeks.", "post_6545338|Are you certain you are only 5 weeks pregnant. By your due date, you should be 7weeks 1 day?Just wondering.", "post_6545780|I was wondering the same thing about your due date. I will be 5 weeks in 2 days and are due September 18th.... But around then yes it's normal... Some don't see anything until 6-9 weeks.", "post_6548204|Sorry ladies. I messed up. My due date isn't until September 16th. Sorry for the confusion.", "post_6548480|I am due September 15th and all I seen was the sac, which is not uncommon.Would have loved to seen more but that didn't happen for me.No need to worry.Congratulations, you are exactly where you need to be!", "post_6548520|I guess I am just concerned because of the bleeding and passing the clot. Also I have dark brown discharge when I go to the bathroom. I am assuming that it is old blood but I don't know. Should I be concerned about that???", "post_6548553|They say (not a professional here) that brown blood isn't necessarily bad, the bright red new blood would be concerning.And of course any bleeding concerns the mommies, but you were just in the hospital and they said that everything looked fine, so try to relax a little bit. I know that is hard, I personally have had 2 mc's and it really sucked, but the more you tense your mind the more your body tenses up.It's like getting a shot in the arm, if you tense you muscles up the more it hurts later, but if you relax and breathe everything isn't so bad.And your mind will free itself of worry.Sorry if that sounded hokey, but it's kinda what I am going through - making myself relax and think positive and enjoy the experience.", "post_6549352|When I was 5 weeks even we just saw a sac ans nothing else. @ 6w1d we even heard Heartbeat. Even I was bleeding till 4 and 1/2 weeks and even now I have spotting which is dark brown blood. Even my nurse told me not to worry till it is bright red and its a lot of blood. Dont worry we know how you feel. Even I am constantly waiting feeling like something is going to go wrong. Dont worry try to relax."]},
{"question_page_id": "1436617", "url": "http://www.medhelp.org/posts/Weight-Loss--Dieting/Whats-wrong-with-me/show/1436617", "comment_num": "10", "question_post_id": "post_6545114", "comment_time": ["post_6545649|Jan 14, 2011", "post_6546036|Jan 14, 2011", "post_6546966|Jan 14, 2011", "post_6549025|Jan 15, 2011", "post_6549221|Jan 15, 2011", "post_6553559|Jan 17, 2011", "post_6557908|Jan 18, 2011", "post_6557948|Jan 18, 2011", "post_6568542|Jan 21, 2011", "post_6569672|Jan 21, 2011"], "comment_user_id": ["post_6545649|1362789", "post_6546036|649848", "post_6546966|1560280", "post_6549025|505857", "post_6549221|649848", "post_6553559|505857", "post_6557908|1560759", "post_6557948|1560759", "post_6568542|505857", "post_6569672|1487356"], "comment_post_id": ["post_6545649", "post_6546036", "post_6546966", "post_6549025", "post_6549221", "post_6553559", "post_6557908", "post_6557948", "post_6568542", "post_6569672"], "comment_content": ["post_6545649|Hello, I can relate to your frustration. But the one thing you should always remember is that you should never ever feel hungy on a Diet! Because that means your starving your self. You should always feel satisfied (not full) but not hungry. Try eating more veggies and fruits to fill you up. Lots of Protien like Lean Meats and chicken (turkey) etc...A trick that I learned is to drink 2 glasses of water right before any meal and you'll feel fuller faster. One of my other problems was that I had a habbit of eating way too fast. Your brain takes 20 minutes to realize that its full. Hope this helps. And don't get disscouraged.", "post_6546036|You can also try eating an apple about 30 minutes before the meal.The fiber will fill you up and since it's complex carb, it takes longer to break down, so you'll stay fuller longer. With that healthy turkey sandwich, you could have added a large green salad, loaded with carrots, celery, cucumbers, radishes or any other veggies you like, without adding more calories.In addition, eat only whole grain bread; again, because that's complex carb that takes longer to break down. Last, but not least, I strongly suggest that you get tested for thyroid issues and insulin resistance. These can cause you either gain weight, or have a hard time losing it.", "post_6546966|Hi I had similar issues to you with dieting I'd eat what I was supposed to on the diet I was on and still be hungry, it turned out taht I was insulin resisitant, so I changed to a Low GI diet and the weight literally jsut fell off.Don't give up,I was trying to fall pregnant at the time, and I found a really useful tool for me was tolook at the food I was wanting to ask myself would I give this to my child, after waht she has already eaten today?and it helped alot it kept me ont he straight and narrow, and I ended up losing enough to get pregnant and give birth to a beautiful healthy daughter.Good luck in your hourney.", "post_6549025|thanks very much guys, im booking an appointment with my doctor for help. Im not getting IVF if i dont lose the weight and i cant do it on my own anymore", "post_6549221|Good luck, and let us know how you turn out.We'll help anyway we can, and hope you'll stick around and join us in the weight loss challenge.", "post_6553559|Thanks very much, i've got an appointment with the doctor tonight so will let you know how it goes", "post_6557908|I", "post_6557948|I think everyone struggles with weight loss especially if they have a goal it can be more stressful. Hang in there and I am sure you will lose the weight. I have found that adding grapefruit and apples to my diet really helps. A grapefruit or grapefruit juice in the am and after each meal. Are you doing Zumba on the kinnect looks like fun. If you have a wii get just dance that burns a hugh amount of calories....", "post_6568542|Thanks very much, i'm doing the kinect adventures and the dance nation which i love.I've cut my calories to 1500 though there are some days i can take as low as 1300.i've been to my doctor who has but me on 500mg of Celeva which is an appetite suppressor as i was having really bad hunger cramps. so far this week i've been doing really well i'm down 2lbs which is a start but when i get under the 15stone mark next week then i'll know if what i'm doing is working or not.I'll just have to do more exercise and eat the way i have been this week and hopefully i'll slowly start seeing results.I'm coming down with the cold though so dreading this weekend think i won't be able to get out of bed i'm feeling really low :(Thanks again though i'll keep you updated :)", "post_6569672|for me when i cut calories back i lost weight, then i platuea, so i restricted my calories further and lost nothing for over a week. and during that week i too was starving and i was actually exercising more, so i increased my calories, and suprisingly i actually lost weight, my body needed more calories to burn and since i wasn't taking in enough calories my body went into starvation mode and held onto the fat for dear life. i'm actually going to get my resting metabolic rate tested sometime at the end of this month or beginning of next so i know exactly how many calories to eat for the most efficient way to lose weight. and on days i don't exercise i dont eat as many calories, but like other poster mentioned when i have a salad i beef it up a bit to make it more filling and i always drink water before eating. i work in a cubicle so i mostly snack all day about every 2 hours so it seems like i'm always eating but i just make sure they are small meals throughout the day, that also seems to keep my metabolism burning. good luck with the weight loss"]},
{"question_page_id": "1436615", "url": "http://www.medhelp.org/posts/Radiology-/Possible-Breast-Cancer-Metastasis/show/1436615", "comment_num": "0", "question_post_id": "post_6545106", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436609", "url": "http://www.medhelp.org/posts/STDs/Can-I-get-an-STD-from-a-handjob-if-the-woman-put-saliva-on-her-palm/show/1436609", "comment_num": "6", "question_post_id": "post_6545072", "comment_time": ["post_6545462_true|Jan 14, 2011", "post_6545188|Jan 14, 2011", "post_6545207|Jan 14, 2011", "post_6545300|Jan 14, 2011", "post_6545367|Jan 14, 2011", "post_6545434|Jan 14, 2011", "post_6545462|Jan 14, 2011"], "comment_user_id": ["post_6545462_true|580755", "post_6545188|580755", "post_6545207|1562711", "post_6545300|652407", "post_6545367|580755", "post_6545434|1562711", "post_6545462|580755"], "comment_post_id": ["post_6545462_true", "post_6545188", "post_6545207", "post_6545300", "post_6545367", "post_6545434", "post_6545462"], "comment_content": ["post_6545462_true|", "post_6545188|No it is not a risk for a STD.", "post_6545207|Dear Vance2335,Thank for getting back to me so quickly.I called my doctor's office but only spoke to the receptionist.She said I was at risk and should come in for a consultation and then get lab testing.2 things:1) Do you know if blood testing labs are unsafe?2) Could you elaborate on why I am not at risk for an STD, just to put my mind at ease?Thank you for your time.", "post_6545300|she doesn't know what she is talking about you were not at risk from your exposure.", "post_6545367|1. Why would a lab be unsafe?2. Saliva is not infectious.", "post_6545434|1) I wasn't sure if there were any disreputable labs or types of labs.There was an incident in south Florida a few years back where War veterans got HIV at a VA hospital because the nurse re-used needles and just used sterilizer to clean them, rather than throwing them away.2) I am not refuting what you said, I just ask because what if she had cold sores in her mouth? Also, I heard even genital contact with the mouth can transmit HPV.I just don't know about mouth-to hand-to genitals.Thanks, buddy.", "post_6545462|1) No one got HIV from that incident. It was reported that they were at risk based on what was done.2) Then she had cold sores on/in her mouth. Meaningless to the hand. Yes mouth to gentials...direct contact with the virus. Not indirect contact. Saliva is not infectious...if it was that means a simple kiss could pass a STD...which it can't. HSV-1 orally is not considered a STD."]},
{"question_page_id": "1436625", "url": "http://www.medhelp.org/posts/Gastroenterology/Strong-bowel-movement/show/1436625", "comment_num": "2", "question_post_id": "post_6545153", "comment_time": ["post_6546251|Jan 14, 2011", "post_6546891|Jan 14, 2011"], "comment_user_id": ["post_6546251|793560", "post_6546891|1562924"], "comment_post_id": ["post_6546251", "post_6546891"], "comment_content": ["post_6546251|Welcome to the gastroenterology community!I don't understand what \"talking strong\" is and I have never heard of \"prelastic of the bowels\" before.Are you constipated or do you have diarrhea?", "post_6546891|I think maybe he/she means \"spastic\" by \"prelastic\"?Assuming you meant you have a lot of gas and diarrhea it could be lactose intolerance or possibly something like Celiac disease.There are tests for both.If you are not a (Northern) European caucasian and you have digestive problems it is probably best to assume that you are lactose intolerant and avoid all milk products.Only a small fraction of people can eat as much lactose as they want as adults, for everybody else it acts as a laxative, with the extent varying a lot from individual to individual.If you are lactose intolerant you are likely also to have similar symptoms if you eat sorbitol (found in diet gum, for instance) or some other (for you) indigestible disaccharides (sugars like lactose made up of two smaller sugars stuck together).There are a lot of other possibilities though.It would help to know where you live, your ethnic background, your current age, what you eat, and any other health problems you might have. Also writing so that we can understand you would help."]},
{"question_page_id": "1436621", "url": "http://www.medhelp.org/posts/Eye-Care/New-eyeglasses-problem/show/1436621", "comment_num": "3", "question_post_id": "post_6545128", "comment_time": ["post_6545427|Jan 14, 2011", "post_6547316|Jan 14, 2011", "post_6547379|Jan 14, 2011"], "comment_user_id": ["post_6545427|711220", "post_6547316|1562729", "post_6547379|1562729"], "comment_post_id": ["post_6545427", "post_6547316", "post_6547379"], "comment_content": ["post_6545427|Return to your doctor.There are too many things that can cause this problem from incorrect prescription, optical center, base curve, etc.Dr. O.", "post_6547316|Hi Doctor, I would like to know if there would be any consequences if i continue wearing this new eye glasses that gives me this problem? Would any part of my eyes be damaged?", "post_6547379|By the way doctor, the eye glasses weren't prescribed by doctor, but instead a regular optician. How is it possible to identify the main cause of this problem? Because if my optician can't help i must do a refund and in order for a refund of this eye glass i would need evidences to proof. Because she can't see from my eyes perspective."]},
{"question_page_id": "1436626", "url": "http://www.medhelp.org/posts/Dental-Health/Is-this-an-emergency/show/1436626", "comment_num": "1", "question_post_id": "post_6545158", "comment_time": ["post_6557126|Jan 18, 2011"], "comment_user_id": ["post_6557126|1562734"], "comment_post_id": ["post_6557126"], "comment_content": ["post_6557126|It's fine.Fillings went ahead as planned."]},
{"question_page_id": "1436627", "url": "http://www.medhelp.org/posts/Hepatitis-B/drugs-with-relevant-hbsag-decrease-hbv-eradication/show/1436627", "comment_num": "1", "question_post_id": "post_6545161", "comment_time": ["post_6545234|Jan 14, 2011"], "comment_user_id": ["post_6545234|1262604"], "comment_post_id": ["post_6545234"], "comment_content": ["post_6545234|stefano, thank you."]},
{"question_page_id": "1436624", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/Am-i-pregnant/show/1436624", "comment_num": "3", "question_post_id": "post_6545150", "comment_time": ["post_6545486|Jan 14, 2011", "post_6545523|Jan 14, 2011", "post_6546803|Jan 14, 2011"], "comment_user_id": ["post_6545486|1456473", "post_6545523|1026926", "post_6546803|1563102"], "comment_post_id": ["post_6545486", "post_6545523", "post_6546803"], "comment_content": ["post_6545486|it could be implantation bleeding, if you were pregnant. have you tested yet? when is your period due?", "post_6545523|Implantations bleeding would not last for 3 weeks and most women will not have implantation bleeding. Do you or have you recently come off the pill? If you were due for your period yu can take a pregnancy test to find out. You may also want to see your doc about the irregular bleeding.", "post_6546803|Yeah i dnt think pregnancy implantation bleeding will last that long at all, it definately not that. I think a doctors visit will help you. because it could be alittle bit of nothing or alotta something and you wouldnt want a problem to go unnoticed when you can catch it early you kinow, plz update i would love to know...best of wishes"]},
{"question_page_id": "1436631", "url": "http://www.medhelp.org/posts/Ask-a-Nurse/Type-of-doctor-to-see/show/1436631", "comment_num": "2", "question_post_id": "post_6545184", "comment_time": ["post_6550101|Jan 15, 2011", "post_6551193|Jan 16, 2011"], "comment_user_id": ["post_6550101|796253", "post_6551193|1558497"], "comment_post_id": ["post_6550101", "post_6551193"], "comment_content": ["post_6550101|Hi and thanks for using the forum.I think you should see your regular family doctor first and then get a referral for a specialist if you need it.Abdominal pain lasting more than a few hours should be evaluated by your doctor.Good luck and hope you feel better soon.Bridget", "post_6551193|Thank you so much for answering my question."]},
{"question_page_id": "1436623", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/Please-comment-on-this-if-you-have-got-pregnant-on-the-depro/show/1436623", "comment_num": "0", "question_post_id": "post_6545149", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436633", "url": "http://www.medhelp.org/posts/Migraines--Headaches/Migraine-HA-Topiramate-use/show/1436633", "comment_num": "4", "question_post_id": "post_6545199", "comment_time": ["post_6546877|Jan 14, 2011", "post_6547568|Jan 14, 2011", "post_6547726|Jan 15, 2011", "post_6556341|Jan 17, 2011"], "comment_user_id": ["post_6546877|947040", "post_6547568|1558541", "post_6547726|1562741", "post_6556341|1566379"], "comment_post_id": ["post_6546877", "post_6547568", "post_6547726", "post_6556341"], "comment_content": ["post_6546877|hi,I have been using toporimate for about a year, 200mg daily. it never really affected my appetite but I did lose about 20 pounds anyway but that was all, actually i needed to lose that much so it was perfect for me. with the toporimate I had a hard time at first because it kind of makes you addle brained, forgetful, hard to stay on task, sometimes dizzy as your body gets used to it. after i was on it a while all of this went away and I function just fine on it. a word of precaution though, he should never quit cold turkey, because even if he never had a seizure in his life, quiting it suddenly can cause one. so anyway, give him some leeway as he adjusts to the med and he will probably be ok, also watch him, as with any drug make sure he does not become suicidal (just a precaution) he could become more moody before he gets better... just keep an eye on him to be safe.,", "post_6547568|Hi!I'm 25 years-old and have been taking topiramate for over 10 years.I started at the 50 mg dose like your son but I'm currently taking 200 mg daily.It has never done anything for my mood (although I have heard that it can) - I take separate medication for anxiety/depression.It also never affected my appetite and it never caused me to lose any weight.When I first started taking it, I had had some drowsiness during the day, but that faded as I adjusted and I haven't had any trouble with it.Like mcamp said, you just have to be careful he never stops taking it abruptly (very dangerous!) and if he misses a dose or two, he will feel side effects (for me its light-headedness, headachy, nauseous).Hope this helps and I hope your son does well!-Kulili-", "post_6547726|Thank you mcamp and Kulili very much.I will keep a close eye on him. Your comments are helpful and most appreciated. :)", "post_6556341|Read your post and felt the need to say that Topirmate has been known to cause kidney stones.You may never, but you may want to consult with your Dr."]},
{"question_page_id": "1436638", "url": "http://www.medhelp.org/posts/Pain-Management/Methadone--Cancer/show/1436638", "comment_num": "1", "question_post_id": "post_6545218", "comment_time": ["post_6551307|Jan 16, 2011"], "comment_user_id": ["post_6551307|547368"], "comment_post_id": ["post_6551307"], "comment_content": ["post_6551307|Hi Jeanne,Welcome to the Pain Management Forum.I am sorry that you are facing radiation and chemo. My heart goes out to you. I hope that the treatment goes well.It is best to consult with your oncologist. He/she will know the right meds for you. We are all different and diseases and the pain that results are often treated differently. It's also true that some physicians prefer this or that med. So please consult your physician.Feel free to post again. I am sorry that I am not able to be more specific. I wish you the very best and hope to hear from you again.Peace,~Tuck"]},
{"question_page_id": "1436637", "url": "http://www.medhelp.org/posts/Heart-Rhythm/Concerned-about-Holter-and-Echo-Results/show/1436637", "comment_num": "1", "question_post_id": "post_6545210", "comment_time": ["post_6545354|Jan 14, 2011"], "comment_user_id": ["post_6545354|995271"], "comment_post_id": ["post_6545354"], "comment_content": ["post_6545354|If your only symptom is palps I personally wouldn't pursue it further. I pursued it for myself with about the same report but I have significant family history of MIs in my family at about my current age.I went as far as nuclear stress tests and a cardiac MRI to rule out as much as I could."]},
{"question_page_id": "1436630", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436630", "comment_num": "0", "question_post_id": "post_6545178", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436632", "url": "http://www.medhelp.org/posts/Ovarian-Cysts/gynecological-follow-up-after-rectal-cancer/show/1436632", "comment_num": "2", "question_post_id": "post_6545198", "comment_time": ["post_6546057|Jan 14, 2011", "post_6568139|Jan 21, 2011"], "comment_user_id": ["post_6546057|286449", "post_6568139|1562740"], "comment_post_id": ["post_6546057", "post_6568139"], "comment_content": ["post_6546057|I am so sorry to hear about your cancer.I would follow your gynecologist's recommendation and get the ultrasound in 3 months.It is unlikely you are facing two different cancers.But, it is possible for the rectal cancer to spread to the female organs.But, usually, you would see more widespread signs of metastasis, rather than just an ovarian cyst if the two were linked.The same virus that is implicated in causing most cervical cancer is also thought to cause most rectal cancer.So, keeping a close eye on the cervix and ovaries is important.You should also continue to get regular pap smears.Ovarian cysts are very common and odds are with you that it is a benign cyst.If you continue to get the recommended checks on time, then you will catch any changes early. My thoughts and prayers are with you for healing!Shelly", "post_6568139|thank you so much.kathy"]},
{"question_page_id": "1436628", "url": "http://www.medhelp.org/posts/Teen-Health/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436628", "comment_num": "0", "question_post_id": "post_6545165", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436639", "url": "http://www.medhelp.org/posts/HIV---Prevention/HIV-and-STD-risk/show/1436639", "comment_num": "3", "question_post_id": "post_6545219", "comment_time": ["post_6545294|Jan 14, 2011", "post_6545390|Jan 14, 2011", "post_6546907|Jan 14, 2011"], "comment_user_id": ["post_6545294|300980", "post_6545390|1558076", "post_6546907|300980"], "comment_post_id": ["post_6545294", "post_6545390", "post_6546907"], "comment_content": ["post_6545294|Welcome to our Forum.I will try to address your questions/concerns however, if you have inflammation on the head of your penis at this time, 5 days following exposure to a commercial sex worker, my advice is that you should be checked by a knowledgeable clinician. On line information is not a substitute for direct examination.I suspect that this might be done best, most confidentially and most cost effectively at your local health department's STD Clinic.You can call the health department and find out here this clinic is and how to access their services.With this as background, let's work through your questions:1.If you have balanitis due to some other cause, there may be a slight increase in risk, IF your partner had HIV.Remember that most commercial sex workers do not have HIV and that the risk of infection through unprotected sexual intercourse, if your partner was infected is only about 1 infection per 1000 exposures.If the risk was doubled, then your risk would still only be 1 in 500 and again, that is only in the unlikely circumstance that your partner had HIV.2.As I said above, I would suggest you get your balanitis examined and be screen for common STDs (gonorrhea/chlamydia) at this ti me.HIV testing will have to wait.HIV antibody tests are completely reliable at 8 weeks following exposure - you do not need to wait 3 months.3.See above.Overall your risk of infection is low but I know you would like the reassurance that negative tests will provide.I hope these comments are helpful.EWH", "post_6545390|Thank you very much! Doc! The inflammation has gone at this time but I still plan to a clinic to be screen for common STDs. Thank you again!", "post_6546907|Glad to help. EWH"]},
{"question_page_id": "1436622", "url": "http://www.medhelp.org/posts/Multiple-Sclerosis/Fresh-Meat/show/1436622", "comment_num": "15", "question_post_id": "post_6545146", "comment_time": ["post_6545175|Jan 14, 2011", "post_6545429|Jan 14, 2011", "post_6545476|Jan 14, 2011", "post_6545519|Jan 14, 2011", "post_6545813|Jan 14, 2011", "post_6545894|Jan 14, 2011", "post_6545916|Jan 14, 2011", "post_6546190|Jan 14, 2011", "post_6547746|Jan 15, 2011", "post_6548044|Jan 15, 2011", "post_6548047|Jan 15, 2011", "post_6548082|Jan 15, 2011", "post_6548955|Jan 15, 2011", "post_6588743|Jan 27, 2011", "post_6588933|Jan 27, 2011"], "comment_user_id": ["post_6545175|1225331", "post_6545429|1561842", "post_6545476|1225331", "post_6545519|1561842", "post_6545813|1396846", "post_6545894|1312898", "post_6545916|738075", "post_6546190|1561842", "post_6547746|1532707", "post_6548044|1561842", "post_6548047|1561842", "post_6548082|1548573", "post_6548955|1561842", "post_6588743|1548573", "post_6588933|198419"], "comment_post_id": ["post_6545175", "post_6545429", "post_6545476", "post_6545519", "post_6545813", "post_6545894", "post_6545916", "post_6546190", "post_6547746", "post_6548044", "post_6548047", "post_6548082", "post_6548955", "post_6588743", "post_6588933"], "comment_content": ["post_6545175|Well,hello, and welcome back to the forum.I'm not glad that you have MS, but I am glad that they figured it all out for you. (Many have to wait years before they get diagnosed.)I was diagnosed in July of 2010.And I started taking Copaxone in late September.I have family in County Roscommon, including many, many, relatives that have passed on.-Kelly", "post_6545429|Thanks for the welcome! Copaxone is indeed one of my options (others being Rebif, Avonex, and Betaferon). Fingolimod doesn't yet have European approval (a likelihood in summer or spring). I'm not indicated for Tysabri at this facility as they reserve that treatment (in light of certain risks) for those who don't seem to respond to the interferons.Interestingly, a study I could be up for would randomise (if that's a word) me to either Avonex or Daclizumab, the latter being similar(ish) to Tysabri in it's mechanism as I understand it. This would interest me as, at least here, it is not currently available outside of this phase II trial and thus far rates somewhere between the Tysabri and interferon relapse rate (It currently it stands at 50% reduction). Copaxone was indicated to me as having a lower side-effect profile. If you don't mind me asking, has your experience born this out? Have you been to Roscommon yourself? But as I said, early days. I've a weekend of cheesy pharmaceutical company DVDs to get through...", "post_6545476|The only side effects that I get with Copaxone are welts every time I inject and a little pain/stinging at the site for about 20 min or so. Sometimes they're worse than other days. Besides that, I don't have any other side effects. I'm not sure what the costs are for the other prescription options, but there's NO WAY I could afford Copaxone without insurance. It costs over $3,000 (US Dollars) a month.I'd like to go to Ireland one day. My mom went a couple times before she died and my grandparents have been back maybe 20 times so far. I think I lost count.From their photos and of course the ones I've seen online, it looks very beautiful there.", "post_6545519|Luckily in Ireland I won't be paying a cent for whichever medication I decide to go with (and that decision is left up to me, with advice made available from the Neurologist and MS Nurse Specialist). The HSE has a Long Term Illness Scheme and a Drugs Payment Scheme. I have to say, I'd be dealing with a hell of a lot more worry if dealing with this new reality also involved potential financial meltdown!Do you know that if your grandparents were born here, you qualify to become a citizen yourself? http://www.citizensinformation.ie/en/moving_country/irish_citizenship/irish_citizenship_through_birth_or_descent.html#l1f4da Unfortunately, I'm a couple of years away from naturalisation. Not a drop of Irish blood in me, just went to university here and later wound up rather in love with a local! Thanks for the first hand information. It's muchly appreciated.", "post_6545813|Hi and welcome to the forum. I am sorry to hear that you got the dx but I am glad you found this community where there are so many people here willing to help and be of assistance. As for the eye issues you are having, if it helps at all you can type in all CAPS and we will return the favor when we respond to your posts. Not sure if that will help you alot but it is an option.I got dx'd (sort of) in September 2010, doc is sure I have it but insurance won't cover the DMD's until there is more proof. I have heard a lot of good things about all the DMD's, copaxone is a big one around here. My sister is on Avonex and has been for 8 years and hasn't had a major relapse since she started it so when I get to take a DMD I will probably try that route first to see if I am as lucky as she is with it. I hope you figure out your DMD soon and you start it and feel much better after. Take Care,Paula", "post_6545894|Welcome to our support forum---but of course sorry to hear of your recent diagnosis.We have many people from the U.K. and I'm sure they will chime in.I'm not on any DMD's so I can't help you there.It's wonderful that you don't have to worry about paying for your scripts there though.Glad to have you hereRed", "post_6545916|Hi, and welcome!I'm sure, since you've been lurking, you've seen the Health Pages (yellow icon, upper right).I've been hanging out here for a couple of years, and I still refer to them!So sorry you have this rotten diagnosis!It took me awhile to wrap my mind around this, but now I'm just determined to LIVE, d@mn it!If I overdo it one day, I may have to pay for it for a few days afterward, but most of the time it was worth it :)Feel Good,Lisa", "post_6546190|Thanks for the welcome, ladies! Well, it is a lot to wrap my head around, and I'm sure there will be ups and downs, but luckily not feeling too overwhelmed for the time being. RE: the all caps, what I'm doing for the time being is just zooming in on the entire screen (cmd+ on a Mac) and that's helping a lot. But thanks for the consideration! Just finished up a round of methylprednisolone and I responded well before, so hopefully the left eye will decide to start pulling her weight again soon! Paula, thank you for the medication input. Trying to find that balance now of relationally informing myself of my DMD options mixed with the feeling of \"GET ON SOMETHING ASAP!\"And Lisa, I think I'm in your camp with regard to outlook. I guess time will tell what my limits are or how the \"live vs. pay-for-it ratio\" pans out. But I'm not writing anything off just yet!Red, thank you for the welcome and the info on some of the international make up on here!", "post_6547746|Howdy Howdy Howdy from Texas. The good thing is you have an answer, that can be the hardest part of the journey sometimes. Looking at your pictures it looks like you had a pretty positive attitude when you got your LP. That is awesome, Use that strength and take it day by day. Hugs Lora", "post_6548044|Cheers, Lora! I've had my down moments too, but try to keep them in their place. Absolutely: looking around I realise how fortunate I am to be able to swiftly get a diagnosis and get moving on this. I think the frustration would bother me as much as the possibility of disease if there seemed to be no answers or a lot of foot-dragging.", "post_6548047|By which I meant metaphorical foot-dragging. I've got the literal version down pat!", "post_6548082|hello fellow european:-) am one of the NHS sufferers (and by that, i DO mean suffering the NHS!) Luckily i work for them, so was diagnosed in september thanks to a doctor friend on my ward, or i would be in limbo land..or blissfully unaware??.....depending on how i am feeling! Have also had eye problems, and a few odd things over the years. Right now i am waiting on my first copaxone delivery so i will keep you posted on how it goes if u like? Declined the interferons on the basis that they make you feel ill and miserable! god knows am struggling to see the bright side at the moment anyway,so,er....no, thanks! x", "post_6548955|Hey there! I'm a HSE kid here. Really beginning to realise how much I've lucked out as far as resources, ease of diagnosis, location of the hospital, etc. Having doctor friends is handy indeed (a friend of mine had interned at the hospital I wound up in with my first symptoms. Good to have someone who knows the way around when you can't see!)Would love to hear how you get on with your Copaxone. If I'm to do this study (Avonex vs. daclizumab), I've a 50 day wait in view of the methylprednisolone I just took, so I've a bit of time to make my decision. All the best!", "post_6588743|hello again :-) just updating u on the copaxone..is all fine. was expecting pain like the swine flu jab but was much better. The ms nurse showed me how to use the autoject (hides the needle!) and is really easy. talking to other people it looks like maybe everyone has a different experience, but personally am finding it ok, stings a bit after the jab but not what i would call 'ow!'pain. Here's hoping fingolimod breezes through NICE...but until then, am doing ok with the copaxone :-) good luck and all the best.x", "post_6588933|Hi Bette!Welcome, welcome! You sound good w/your dx. If I'm reading you right, good for you.I'm on Rebif and we have a slew of other folks on the gammit of DMDs, and even those who have been on the oral, Gilenya. Ask away when your ready -- we can even bump a few older discussions on it if you like.Nice to have you with us, and I'm sure many of our members will hit you up on your offer ref. the NHS, etc.See you around. Hope you get some relief w/your vision.~Shell"]},
{"question_page_id": "1436640", "url": "http://www.medhelp.org/posts/Lyme-Disease/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436640", "comment_num": "0", "question_post_id": "post_6545223", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436636", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/trying-to-conceive/show/1436636", "comment_num": "2", "question_post_id": "post_6545208", "comment_time": ["post_6545620|Jan 14, 2011", "post_6545791|Jan 14, 2011"], "comment_user_id": ["post_6545620|689528", "post_6545791|134578"], "comment_post_id": ["post_6545620", "post_6545791"], "comment_content": ["post_6545620|Not sure....you didn't give too much info to go with. When was your last period? Did you just come off birth control? If you're late, you can always test and see.", "post_6545791|Discharging pink and brown is not a sure sign of pregnancy, nor does it indicate you are not.Why not test?"]},
{"question_page_id": "1436629", "url": "http://www.medhelp.org/posts/Pregnancy-18-24--/due-date-determination/show/1436629", "comment_num": "4", "question_post_id": "post_6545167", "comment_time": ["post_6545273_true|Jan 14, 2011", "post_6545185|Jan 14, 2011", "post_6545273|Jan 14, 2011", "post_6545352|Jan 14, 2011", "post_6546038|Jan 14, 2011"], "comment_user_id": ["post_6545273_true|1555916", "post_6545185|1271927", "post_6545273|1555916", "post_6545352|1561663", "post_6546038|1555916"], "comment_post_id": ["post_6545273_true", "post_6545185", "post_6545273", "post_6545352", "post_6546038"], "comment_content": ["post_6545273_true|", "post_6545185|I think most professionals agree that the early ultrasound is the best date to go by.", "post_6545273|That's a diff of 5.5 weeks.. I would go off the ultrasound since ur menstral wasn't normal.. Otherwise attime of ultrasound u should have measured 12wks 4dys so baby would b measuring way too small to go off ur menstral I would def stick with ultrasound date but b prepared just in case.. It never hurts to prepare urself for something that \"could\" happen.. But hopefully not the case otherwise baby would b smaller.. I'd ask for another ultrasound for measurements..! Good luck!!", "post_6545352|Thank you for your advice!Of course when you get to the third trimester, you're extremely uncomfortable, you start to wish your due date were sooner:)", "post_6546038|U r right I wish my due date was sooner I walk around like my water could break any moment lol.. I feel like a beach whale getting ready to burst and I'm 28wks.. Right behind u.. So trust me I know how u feel.. My ultrasounds say I'm measuring ahead of time in which my last period wasn't normal so I hope I'm further along too.. But it's all wishful thinking.. Lol but like I said b prepared anyways lol!!!"]},
{"question_page_id": "1436635", "url": "http://www.medhelp.org/posts/Pregnancy-35/FREE-Health-Chat---Thyroid-Disorders-When-Your-Thyroid-Malfunctions/show/1436635", "comment_num": "0", "question_post_id": "post_6545205", "comment_time": [], "comment_user_id": [], "comment_post_id": [], "comment_content": []},
{"question_page_id": "1436634", "url": "http://www.medhelp.org/posts/Gastroenterology/Elevated-ALT-and-AST--High-abdominal-pain-and-rib-cage-aches/show/1436634", "comment_num": "1", "question_post_id": "post_6545201", "comment_time": ["post_8476366|Nov 01, 2012"], "comment_user_id": ["post_8476366|4255894"], "comment_post_id": ["post_8476366"], "comment_content": ["post_8476366|Hi,This sounds like what I am going through only I do not share the same medical history as you, with the exception of being pre-diabetic. I have been tested for countless diseases all with negative results yet my alt and ast continue to rise. Did the doctors find the answer to your problem?"]},
{"question_page_id": "1436641", "url": "http://www.medhelp.org/posts/Womens-Health/who-could-be-the-daddy/show/1436641", "comment_num": "2", "question_post_id": "post_6545226", "comment_time": ["post_6545381|Jan 14, 2011", "post_6545781|Jan 14, 2011"], "comment_user_id": ["post_6545381|1027094", "post_6545781|134578"], "comment_post_id": ["post_6545381", "post_6545781"], "comment_content": ["post_6545381|Well if your lmp was on the 9th, and you had sex with your ex on the 13th ( 4 days later) It IS MOST likely the NEW guys.", "post_6545781|Did your period start or end on the 9th?If the latter, it is possible that either guy is the dad, especially since sperm can live 4 or even 5 days in the female reproductive tract.I assume you are saying the sex on the 13th was unprotected?One way to try to get a clue is to have an ultrasound in your seventh week (from the period that began December 9, so around the last week of January or the first week of February.Ask the tech to tell you (by the crown-to-rump measurement of the baby) an estimated CONCEPTION date, not the length of the pregnancy.(She will otherwise tell you how long it has been since the first day of your last period.)This is not a totally accurate way to date a pregnancy, but it is better than just wishing and hoping.Given that the two dates are only a week apart, this might not be a reliable way to tell, and you really are going to need to do a DNA test once the baby is born in any case.It's only fair to the baby, and to the father also."]}]