[{"journal_content": "Ok, I am a 28 year old female who have been experiencing pulsatile tinnitus on the left side and it doesn't go away and it has gotten louder and louder.  I also feels many times thruoughout the day and night pain in the jugular, and whole left side of head, I also feel like the arteries of my neck get hard. \rNo Doctor has been able to help but my ENT who reffered me to a neurosurgeon tomorrow.  The neurologyst I first went to ordered and MRI and MRA and called me to tell me it was negative and that was all.  I went to pick up all the tests results do that the neurosurgeon can read them and this is what it says... \r\r\rThe partially visualized paranasal sinuses reveals partial opacification of the left frontal and anterior ethmoid sinuses.  The mastoid air cells are well aerated bilaterally.  The partially visualized orbits are unremarkable in appearance. \r\rThere is no significant stenosis, ectasia or auneurysmal dilatation greater than 3mm identified on the current examination.  Mild irregularity at the proximal left Petrus internal carotid artery is likely artifactual.  Otherwise, normal flow related enhancement is identified throughout. \r\rThe Neurologyst never took the time to go over anything with me.  I appreciate if someone can please help me since Ive had bad luck with doctors and Ive been bounce around for a while. \r\rThank you", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8554/MRI-MRA-Results", "journal_reply": "1", "journal_title": "MRI MRA Results", "journal_id": "8554", "user_p_id": "http://www.medhelp.org/personal_pages/show/1638?personal_page_id=1638"},
{"journal_content": "Hello all, finally today after 2 months I found a doctor who looked at my tests twice and found out what is going on with me, eventhough the mri,mra,ct scan and carotid ultrasound were all negative. \rHe is a neurosurgeon and he even took the time to take me to his office with my family and showed me all of the images and what he found and explained it, thank you Jesus. \rMy left jugular vein looks lie its clogged and now an angiogram has been ordered to find out if its a fitsula or blood clots causing it. \rIts sad to find out that since its been like that for a few months its not save to unclogged it, all this time while the doctors said nothing was going on.  He also took the time to ask me about my family and mine history and a lot came up that was helpfull.  Finally I get an answer for this headaches, the tinnitus, the hardening of the vein in y neck. \r\rIf someone have had angiograms done that can share experiences please feel free since I am kind of scare and he also said he is gonna try the balloon thingy and obstruct the vein. \r\rThank you", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8552/Finally-a-doctor-who-cared", "journal_reply": "0", "journal_title": "Finally a doctor who cared", "journal_id": "8552", "user_p_id": "http://www.medhelp.org/personal_pages/show/1638?personal_page_id=1638"},
{"journal_content": "Hello I am 28 years old and this is what is going on. \rI have been sick on and off for the past 2 months, on March 5th my body gave up and my husband took me to the ER where they diagnosed me with pneumonia. Was put on antibiotics for 5 days and cough medication.  Four days later I realized I could hear an \"ultrasound noise\", how I can best describe it, and it was so loud it was scary, I had terrible headaches and started vomiting, so again to the ER where they did a CT scan without contrast and they found ild moucus on the left frontal sinuses, then they put me on antibiotics for another 10 days and oxycoden por pain.  The headaches have been worst, I feel pressure on the inside of my ear too and the noise is driving me insane, when I push down on my jugular vein, it stops.  I went back a wk later because I felt the pain down my neck to my shoulder and chest, they did and EKG was normal, then a carotid ultra sound and the doctor told me that what they found wasn't something to admitt me immediately but to go to a Neuro.  So I did, she didnt even touched me, but based on what I told her, she diagnosed me with Pulsatile Tinnitus, then they ordered a MRI/MRA with and without contrast, the nurse called me and said the doctor had asked to call me to let me know its negative....whats negative?? So frustrating!! So last nite was one of the worst the pains are killing me, I went to ENT today, they did audiogram and I passed nicely and all. He then says I sound like I have a \"major sinus infection\", doeas not even mention the tinnitus, and puts me on steroids and antibiotics for another week. \rAm I on the right track here?  Can someone help me? \rI appreciate it!", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8553/My-story", "journal_reply": "0", "journal_title": "My story", "journal_id": "8553", "user_p_id": "http://www.medhelp.org/personal_pages/show/1638?personal_page_id=1638"},
{"journal_content": "There's been a lot of water under the bridge since I last posted.  I won't take the time to give you a play by play account of my life since then but I'll try to give a brief summary of what's important.\r\rThe doctor said I would not clear the hep-c virus and that there was no point in continuing the treatment.  I completed 28 weeks of the 48 weeks treatment plan.  I've been off the medication about six months now and I feel better than I did before the treatments began.  I've not done anything very productive for about 1 & 1/2 yrs. now but I have just accepted a position on the staff of the last church that I pastored.  I will have a somewhat active role, but not a full time pastoral role.  At least, I will hopefully begin to feel more useful.  I've changed my eating habits and I will be exercising more, ......... I hope!  \r\rWhat happened?  I'm glad you asked.  One Sunday night in church, while the whole congregation was standing and singing, the words of the song impressed me so strongly that I made comments to my wife and my mother about it and believe that at that time I was given assurance from God that I was going to be alright.  What was that song?  Again, I'm glad you asked.  The name of the song was \"Can't Nobody Do Me Like Jesus\".  The words that really impressed me were from the verse that says, \"He heald my body and He told me to run on.\"  At that time, I didn't know what the doctor's report was going to be the following Wednesday, but when I heard his report, I knew that God had prepared me for such and so I took comfort in the words of the song.  To God be the glory!\r\rIf you want to know more about that or my progress through the treatments, go to my blogspot and click on the label \"My Progress\".  (labrannen.blogspot.com).", "journal_time": "Apr 10, 2008", "url": "http://www.medhelp.org/user_journals/show/8550/Alive-and-well", "journal_reply": "1", "journal_title": "Alive and well!", "journal_id": "8550", "user_p_id": "http://www.medhelp.org/personal_pages/show/2925?personal_page_id=2925"},
{"journal_content": "My husband has been having chest pains that come and go. Some being sever. We ended up in ER and was hospitalized for three days. They first said he had on a scale from 1-10 his heart was a 4. Ecco gram they said wasn't good nor was the stress test. He was trans ported for cardio cath and was later released, said not cardiac problem. Dr's report states mild inferopical hypokinesis and left ventricular function with mild focal hypokinesis. Still having chest pains that come and go. Have had ultrsound of abdomen and still no answers. What to do now? We need answers....Don't know exactly what those results mean. HELP!!!", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8555/Need-answers", "journal_reply": "0", "journal_title": "Need answers....", "journal_id": "8555", "user_p_id": "http://www.medhelp.org/personal_pages/show/22163?personal_page_id=22163"},
{"journal_content": "I asked God to take away my pride & God said \"NO\"  He said it was not for Him to take away but for me to give it up.\r\rI asked God to heal my diesease & God said \"NO\"  He said  \"Your spirit is whole , your body is only temporary.  Through your afflictions you will learn to help others who also suffer.\"\r\rI asked God to grant me patience & God said \"NO\"  He said that patience is a by-product of tribulation.  \"It isn't granted it is earned\"\r\rI asked God to give me happiness & God said \"NO\"  He said that he gives blessings, happiness is up to me.\r\rI asked God to spare me pain & God said \"NO\"  He said  \"Suffering draws you apart from worldly cares & brings you closer to me.\"\r\rI asked God to make my spirit grow & God said \"NO\"  He said that I must grow on my own, but He will prune me to make me fruitful.\r\rI asked God if He loved me & God said \"YES\"  He said  \"I gave my only Son who died for you  You will be in heaven someday because you believe.\"\r\rI asked God to help me love others as much as he loves me & God said,  \"Ah...Finally you understand...\"  \r\rGod Bless!\r\r(((Seek the Lord & His strength; Seek His face continually.  Psalm 105:4)))", "journal_time": "Apr 10, 2008", "url": "http://www.medhelp.org/user_journals/show/8551/I-Asked-God--He-said-NO", "journal_reply": "1", "journal_title": "I Asked God & He said \"NO\"", "journal_id": "8551", "user_p_id": "http://www.medhelp.org/personal_pages/show/138?personal_page_id=138"},
{"journal_content": "\"All spiritual awakenings have some thing in common.\rCommon elements include an end to loneliness & a sense of direction in our lives.\"", "journal_time": "Apr 12, 2008", "url": "http://www.medhelp.org/user_journals/show/8665/The-Big-Picture", "journal_reply": "1", "journal_title": "The Big Picture", "journal_id": "8665", "user_p_id": "http://www.medhelp.org/personal_pages/show/138?personal_page_id=138"},
{"journal_content": "Ok its nearly 12pm and ive had two pain pills and to be fair im feeling pretty good but im worried because ive only got two left.\rI did have half a box full but my boyfriend took them last night so im going to have to be really strong and not put any pressure on him to bring me them back.\r\rHes going to do some thing special for me tonight to try and take my mind off it  Is going to have to be some thing more than special to take my mind off them.\r\rHeres to my weekend of cold turkey.x", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8564/Friday--D-day", "journal_reply": "1", "journal_title": "Friday- D day", "journal_id": "8564", "user_p_id": "http://www.medhelp.org/personal_pages/show/15008?personal_page_id=15008"},
{"journal_content": "i,m 19 mths on now with this illness which noone seems to have any answers for.the constant severe pain i am experiencing everyday is never ending,some days i just feel like giving up but then i think of my husband and children and fai=mily members and have to carry on.i just want to kno what this illness is and find a way of coping x", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8561/when-will-i-get-any-answershelp", "journal_reply": "2", "journal_title": "when will i get any answers????????help???", "journal_id": "8561", "user_p_id": "http://www.medhelp.org/personal_pages/show/3628?personal_page_id=3628"},
{"journal_content": "Shameful and unforgivable the things i have done because of drug addiction.\rIve hurt my family, friends and most of all i have ruined myself.\rIm so ashamed i cant even ask for help, i think i'll die first, i think id rather\rsometimes. Its a terrible terrible feeling to wake up one day and realize,\r\"oh ****, im a drug addict\". Its one thing to realize and try to change it.\rIts a whole other story to realize it and continue it almost to the point of suicide.\rI keep telling myself next month ill stop, but on my own. Never will i ask for \rprofessional help.I havent really even admitted the extent of my addiction to my \rpartner of 8 years. I think he has his idea's about it, but he has no idea how bad i am.\rOr maybe he does and is more in denial than myself.", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8563/never-meant-to-live-like-this", "journal_reply": "1", "journal_title": "never meant to live like this..", "journal_id": "8563", "user_p_id": "http://www.medhelp.org/personal_pages/show/3492?personal_page_id=3492"},
{"journal_content": "8dpo and the maddness is in full swing. My chart continues looking great. I am imagining nearly every symptom you can get. I can't wait to tear open that wrapper and sit poised over the bathroom vanity staring at it for 10 mins straight! Oh heavens, I may not make it! I want to wait til Tues, but if I can get to Mon it wil be a miracle. Of course, if my temps plummet between now and then, the whole thrill will be gone. I know I am getting my hopes too high and am going to have a long fall. But, boy is it fun while it lasts!", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8562/4-11-08", "journal_reply": "2", "journal_title": "4/11/08", "journal_id": "8562", "user_p_id": "http://www.medhelp.org/personal_pages/show/7595?personal_page_id=7595"},
{"journal_content": "Consulted GP regarding bladder problems - He did not believe in PSA TESTS given antibiotic for mild infrection.  Reluctantly referred me to Urologist in City of Geelong as he considered me too old for surgery etc. This was a private consulation.  I had had ultra-sound two years previously for immigration medical requirements. Immigration urologist commented on the large number of bladder stones, but did not recommend any treatment.  New Urologist was given the plates but was not interested stating that there was no apparent evidence of bladder stones.\r\rHe said he did not require ultra sound and the procedure would take about 50 minutes.   Nurologist visited me after surgery and, apparently resentfully, said the whole procedure had taken nearly three hours due to unexpected ! bladder stones.   Was discharged after three nights but had to retain \" plumbing\" as bladder would not respond.  Unexpectedly the nurologist had taken three week holiday without advising me of any \"stand-in\"  Saw him at first opportunity and bladder was by then more or less working correctly.    However a major infection was found and I remained on repeated courses of various antibiotics for next six months . Urologist discharged me to my GP, but telephoned to change instructions and to have further ultra-sound.  This ultrasound revealed a large bladder stone subsequently found to be in a \"fold\" of the bladder wall,   Day procedure for removal, but ultra sound photos were of very poor quality.\r\rEvery since the original operation I have experienced very disappointing wallking problems where it feels that my lower legs and feet do not really belong to me and I have had considerable discomfort and mild pain.  I continually \"trip up\".  Prior to the operation I frequently took walks of up to 5 miles and I cannot now walk for more than a mile with considerable discomfort.  The nurologist has been told on every visit about every three/four weeks, he has never examined my feet/legs and merely tells me to take more exercise - I swim for an hour or two every other day", "journal_time": "Apr 11, 2008", "url": "http://www.medhelp.org/user_journals/show/8558/Wing-Commander", "journal_reply": "0", "journal_title": "Wing Commander", "journal_id": "8558", "user_p_id": "http://www.medhelp.org/personal_pages/show/34501?personal_page_id=34501"},
{"journal_content": "Just a test journal entry.", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/4/I-like-this-sitevery-cool", "journal_reply": "0", "journal_title": "I like this site...very cool", "journal_id": "4", "user_p_id": "http://www.medhelp.org/personal_pages/show/5502?personal_page_id=5502"},
{"journal_content": "test", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/5/Test-Numero-Dos", "journal_reply": "0", "journal_title": "Test Numero Dos", "journal_id": "5", "user_p_id": "http://www.medhelp.org/personal_pages/show/5502?personal_page_id=5502"},
{"journal_content": "My therapist told me to be very careful as to where I get my information to find the answers I am looking for to help me understand and control my illness. I guess I am stuck with this for always, \"till death do us part\" WOW the only thing I can do is to learn and control each episode as I go through them...This is the sight that is the true Mental Health source ... as I am told by my therapist at the Mental Health Center.... You decide for your self.... NOTE, this has nothing to do with this forum being other than a great help sight for people like us and other illnesses to come together...\rThe National Institute of Mental Health (NIMH)\rhttp://www.nimh.nih.gov/index.shtml\rYou can also Google it by NIHM\rHope this will help us all...\rsam", "journal_time": "Apr 10, 2008", "url": "http://www.medhelp.org/user_journals/show/8549/The-National-Institute-of-Mental-Health-NIMH", "journal_reply": "0", "journal_title": "The National Institute of Mental Health (NIMH)", "journal_id": "8549", "user_p_id": "http://www.medhelp.org/personal_pages/show/1647?personal_page_id=1647"},
{"journal_content": "So this is my first entry. Nothing truly exciting to write about except the fact that I will be able to :)", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/6/I-LOVE-having-a-journal", "journal_reply": "0", "journal_title": "I *LOVE* having a journal", "journal_id": "6", "user_p_id": "http://www.medhelp.org/personal_pages/show/372?personal_page_id=372"},
{"journal_content": "Friday is my favorite day of the week. There is great anticipation of breaking the routine of the week and getting a bit of down time. What makes Friday extra special is that Saturday follows :)", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/7/I-love-Fridays", "journal_reply": "3", "journal_title": "I love Fridays", "journal_id": "7", "user_p_id": "http://www.medhelp.org/personal_pages/show/372?personal_page_id=372"},
{"journal_content": "My son started a new preschool and the approaches are very different. \rThe previous school made sure all the toys were education and it was \rgreat because it taught him a lot. He like the school but by\rthe end of the day was waiting to come home. The new school\rhas a lot more non-educaitonal toys that are a lot of fun. He loves\rplaying with these and doesn't want to come home at the end of the\rday but learns less. Since this is pre-school I don't know which is better.\rLove to hear your thoughts.", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/11/A-different-approach-to-learning", "journal_reply": "1", "journal_title": "A different approach to learning", "journal_id": "11", "user_p_id": "http://www.medhelp.org/personal_pages/show/383?personal_page_id=383"},
{"journal_content": "I blogged on a podcast/radio broadcast that I did on the increase in childhood hypertension, copy & paste the URL link below for a partial transcript of the broadcast.", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/9/30-increase-in-childhood-high-blood-pressure", "journal_reply": "0", "journal_title": "30% increase in childhood high blood pressure", "journal_id": "9", "user_p_id": "http://www.medhelp.org/personal_pages/show/1515?personal_page_id=1515"},
{"journal_content": "Test", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/12/Overview", "journal_reply": "0", "journal_title": "Overview", "journal_id": "12", "user_p_id": "http://www.medhelp.org/personal_pages/show/5712?personal_page_id=5712"},
{"journal_content": "Hmmm...a journal. A place to express my thoughts in all there myriad bizarre forms. How exciting! Heh heh...\r\rI'm on day 3 of stopping cigarettes. At present smoking a pipe on occasion. \rNo, wait, it makes sense, really! \r\rYou see, I'm married and we both smoke. We've been in a standoff over stopping smoking. My way is to stop completely, cold turkey, so to speak.\r\rMy wife's way is to taper down gradually, timing her cigarettes, etc...\r\rI can't stop cold turkey and watch her smoking, I'd go insane.\r\rShe can't taper because I can't control myself with cigarettes, not that type of personality with it. I do or I don't.\r\rThus, a stand off.\r\rNow, this is where you get the difference between fifteen years of *blissful\" marriage as opposed to few months followed by a messy divorce.\rI came up with the solution of \"I'll switch to a pipe for now. That way, YOU can taper. Pipes can only be used at home really, can't be used on the move, so I'll be cutting down dramatically too. Plus, I won't go insane when you light a cigarette. You won't go crazy when I light the pipe.\rIn a week or two, I'll be so nauseous from smoking a pipe, that I'll be relieved to finally stop. You should have the time you need to taper.\rAND, we save hundred's of dollars meanwhile. Everyone's happy!\r\rAnd so, we have the beginnings of a compromise, that so far is working out. Mind you, it took MONTHS before we came up with this solution. During that time, we didn't bicker and fight (well, not TOO much) about it. Just \"waited until a solution arose\". Until it came up, NEITHER of us could budge. If you know something isn't going to work, well...there's no point in forcing the issue. It just creates misery.", "journal_time": "Sep 14, 2007", "url": "http://www.medhelp.org/user_journals/show/14/September-12th--2007", "journal_reply": "2", "journal_title": "September 12th, 2007", "journal_id": "14", "user_p_id": "http://www.medhelp.org/personal_pages/show/291?personal_page_id=291"}]